FreeRTOS/FreeRTOS/FreeRTOS/Demo/RX200_RX210-RSK_Renesas/RTOSDemo/include/RX62Niodefine.h
struct st_can
{
    struct
    {
        union
        {
            unsigned long LONG;
            struct
            {
                unsigned short H;
                unsigned short L;
            }
            WORD;
            struct
            {
                unsigned char HH;
                unsigned char HL;
                unsigned char LH;
                unsigned char LL;
            }
            BYTE;
            struct
            {
                unsigned long IDE : 1;
                unsigned long RTR : 1;
                unsigned long : 1;
                unsigned long SID : 11;
                unsigned long EID : 18;
            }
            BIT;
        }
        ID;
        union
        {
            unsigned short WORD;
            struct
            {
                unsigned char H;
                unsigned char L;
            }
            BYTE;
            struct
            {
                unsigned char : 8;
                unsigned char : 4;
                unsigned char DLC : 4;
            }
            BIT;
        }
        DLC;
        unsigned char DATA[ 8 ];
        union
        {
            unsigned short WORD;
            struct
            {
                unsigned char TSH;
                unsigned char TSL;
            }
            BYTE;
        }
        TS;
    }
    MB[ 32 ];
    union
    {
        unsigned long LONG;
        struct
        {
            unsigned short H;
            unsigned short L;
        }
        WORD;
        struct
        {
            unsigned char HH;
            unsigned char HL;
            unsigned char LH;
            unsigned char LL;
        }
        BYTE;
        struct
        {
            unsigned long : 3;
            unsigned long SID : 11;
            unsigned long EID : 18;
        }
        BIT;
    }
    MKR[ 8 ];
    union
    {
        unsigned long LONG;
        struct
        {
            unsigned short H;
            unsigned short L;
        }
        WORD;
        struct
        {
            unsigned char HH;
            unsigned char HL;
            unsigned char LH;
            unsigned char LL;
        }
        BYTE;
        struct
        {
            unsigned long IDE : 1;
            unsigned long RTR : 1;
            unsigned long : 1;
            unsigned long SID : 11;
            unsigned long EID : 18;
        }
        BIT;
    }
    FIDCR0;
    union
    {
        unsigned long LONG;
        struct
        {
            unsigned short H;
            unsigned short L;
        }
        WORD;
        struct
        {
            unsigned char HH;
            unsigned char HL;
            unsigned char LH;
            unsigned char LL;
        }
        BYTE;
        struct
        {
            unsigned long IDE : 1;
            unsigned long RTR : 1;
            unsigned long : 1;
            unsigned long SID : 11;
            unsigned long EID : 18;
        }
        BIT;
    }
    FIDCR1;
    unsigned long MKIVLR;
    unsigned long MIER;
    char wk0[ 1008 ];
    union
    {
        unsigned char BYTE;
        union
        {
            struct
            {
                unsigned char TRMREQ : 1;
                unsigned char RECREQ : 1;
                unsigned char : 1;
                unsigned char ONESHOT : 1;
                unsigned char : 1;
                unsigned char TRMABT : 1;
                unsigned char TRMACTIVE : 1;
                unsigned char SENTDATA : 1;
            }
            TX;
            struct
            {
                unsigned char : 5;
                unsigned char MSGLOST : 1;
                unsigned char INVALDATA : 1;
                unsigned char NEWDATA : 1;
            }
            RX;
        }
        BIT;
    }
    MCTL[ 32 ];
    union
    {
        unsigned short WORD;
        struct
        {
            unsigned char H;
            unsigned char L;
        }
        BYTE;
        struct
        {
            unsigned char : 2;
            unsigned char RBOC : 1;
            unsigned char BOM : 2;
            unsigned char SLPM : 1;
            unsigned char CANM : 2;
            unsigned char TSPS : 2;
            unsigned char TSRC : 1;
            unsigned char TPM : 1;
            unsigned char MLM : 1;
            unsigned char IDFM : 2;
            unsigned char MBM : 1;
        }
        BIT;
    }
    CTLR;
    union
    {
        unsigned short WORD;
        struct
        {
            unsigned char H;
            unsigned char L;
        }
        BYTE;
        struct
        {
            unsigned char : 1;
            unsigned char RECST : 1;
            unsigned char TRMST : 1;
            unsigned char BOST : 1;
            unsigned char EPST : 1;
            unsigned char SLPST : 1;
            unsigned char HLTST : 1;
            unsigned char RSTST : 1;
            unsigned char EST : 1;
            unsigned char TABST : 1;
            unsigned char FMLST : 1;
            unsigned char NMLST : 1;
            unsigned char TFST : 1;
            unsigned char RFST : 1;
            unsigned char SDST : 1;
            unsigned char NDST : 1;
        }
        BIT;
    }
    STR;
    union
    {
        unsigned long LONG;
        struct
        {
            unsigned short H;
            unsigned short L;
        }
        WORD;
        struct
        {
            unsigned char HH;
            unsigned char HL;
            unsigned char LH;
            unsigned char LL;
        }
        BYTE;
        struct
        {
            unsigned long TSEG1 : 4;
            unsigned long : 2;
            unsigned long BRP : 10;
            unsigned long : 2;
            unsigned long SJW : 2;
            unsigned long : 1;
            unsigned long TSEG2 : 3;
        }
        BIT;
    }
    BCR;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char RFEST : 1;
            unsigned char RFWST : 1;
            unsigned char RFFST : 1;
            unsigned char RFMLF : 1;
            unsigned char RFUST : 3;
            unsigned char RFE : 1;
        }
        BIT;
    }
    RFCR;
    unsigned char RFPCR;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char TFEST : 1;
            unsigned char TFFST : 1;
            unsigned char : 2;
            unsigned char TFUST : 3;
            unsigned char TFE : 1;
        }
        BIT;
    }
    TFCR;
    unsigned char TFPCR;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char BLIE : 1;
            unsigned char OLIE : 1;
            unsigned char ORIE : 1;
            unsigned char BORIE : 1;
            unsigned char BOEIE : 1;
            unsigned char EPIE : 1;
            unsigned char EWIE : 1;
            unsigned char BEIE : 1;
        }
        BIT;
    }
    EIER;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char BLIF : 1;
            unsigned char OLIF : 1;
            unsigned char ORIF : 1;
            unsigned char BORIF : 1;
            unsigned char BOEIF : 1;
            unsigned char EPIF : 1;
            unsigned char EWIF : 1;
            unsigned char BEIF : 1;
        }
        BIT;
    }
    EIFR;
    unsigned char RECR;
    unsigned char TECR;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char EDPM : 1;
            unsigned char ADEF : 1;
            unsigned char BE0F : 1;
            unsigned char BE1F : 1;
            unsigned char CEF : 1;
            unsigned char AEF : 1;
            unsigned char FEF : 1;
            unsigned char SEF : 1;
        }
        BIT;
    }
    ECSR;
    unsigned char CSSR;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char SEST : 1;
            unsigned char : 2;
            unsigned char MBNST : 5;
        }
        BIT;
    }
    MSSR;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char : 6;
            unsigned char MBSM : 2;
        }
        BIT;
    }
    MSMR;
    unsigned short TSR;
    unsigned short AFSR;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char : 5;
            unsigned char TSTM : 2;
            unsigned char TSTE : 1;
        }
        BIT;
    }
    TCR;
};

