FreeRTOS/FreeRTOS/FreeRTOS/Demo/RX200_RX210-RSK_Renesas/RTOSDemo/include/RX62Niodefine.h
struct st_cmt
{
    union
    {
        unsigned short WORD;
        struct
        {
            unsigned short : 14;
            unsigned short STR1 : 1;
            unsigned short STR0 : 1;
        }
        BIT;
    }
    CMSTR0;
    char wk0[ 14 ];
    union
    {
        unsigned short WORD;
        struct
        {
            unsigned short : 14;
            unsigned short STR3 : 1;
            unsigned short STR2 : 1;
        }
        BIT;
    }
    CMSTR1;
};

struct st_cmt0
{
    union
    {
        unsigned short WORD;
        struct
        {
            unsigned short : 9;
            unsigned short CMIE : 1;
            unsigned short : 4;
            unsigned short CKS : 2;
        }
        BIT;
    }
    CMCR;
    unsigned short CMCNT;
    unsigned short CMCOR;
};

struct st_crc
{
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char DORCLR : 1;
            unsigned char : 4;
            unsigned char LMS : 1;
            unsigned char GPS : 2;
        }
        BIT;
    }
    CRCCR;
    unsigned char CRCDIR;
    unsigned short CRCDOR;
};

struct st_da
{
    unsigned short DADR0;
    unsigned short DADR1;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char DAOE1 : 1;
            unsigned char DAOE0 : 1;
            unsigned char DAE : 1;
        }
        BIT;
    }
    DACR;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char DPSEL : 1;
        }
        BIT;
    }
    DADPR;
};

struct st_dmac
{
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char : 7;
            unsigned char DMST : 1;
        }
        BIT;
    }
    DMAST;
};

struct st_dmac0
{
    void * DMSAR;
    void * DMDAR;
    unsigned long DMCRA;
    unsigned short DMCRB;
    char wk0[ 2 ];
    union
    {
        unsigned short WORD;
        struct
        {
            unsigned short MD : 2;
            unsigned short DTS : 2;
            unsigned short : 2;
            unsigned short SZ : 2;
            unsigned short : 6;
            unsigned short DCTG : 2;
        }
        BIT;
    }
    DMTMD;
    char wk1[ 1 ];
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char : 3;
            unsigned char DTIE : 1;
            unsigned char ESIE : 1;
            unsigned char RPTIE : 1;
            unsigned char SARIE : 1;
            unsigned char DARIE : 1;
        }
        BIT;
    }
    DMINT;
    union
    {
        unsigned short WORD;
        struct
        {
            unsigned short SM : 2;
            unsigned short : 1;
            unsigned short SARA : 5;
            unsigned short DM : 2;
            unsigned short : 1;
            unsigned short DARA : 5;
        }
        BIT;
    }
    DMAMD;
    char wk2[ 2 ];
    unsigned long DMOFR;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char : 7;
            unsigned char DTE : 1;
        }
        BIT;
    }
    DMCNT;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char : 3;
            unsigned char CLRS : 1;
            unsigned char : 3;
            unsigned char SWREQ : 1;
        }
        BIT;
    }
    DMREQ;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char ACT : 1;
            unsigned char : 2;
            unsigned char DTIF : 1;
            unsigned char : 3;
            unsigned char ESIF : 1;
        }
        BIT;
    }
    DMSTS;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char : 7;
            unsigned char DISEL : 1;
        }
        BIT;
    }
    DMCSL;
};

struct st_dmac1
{
    void * DMSAR;
    void * DMDAR;
    unsigned long DMCRA;
    unsigned short DMCRB;
    char wk0[ 2 ];
    union
    {
        unsigned short WORD;
        struct
        {
            unsigned short MD : 2;
            unsigned short DTS : 2;
            unsigned short : 2;
            unsigned short SZ : 2;
            unsigned short : 6;
            unsigned short DCTG : 2;
        }
        BIT;
    }
    DMTMD;
    char wk1[ 1 ];
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char : 3;
            unsigned char DTIE : 1;
            unsigned char ESIE : 1;
            unsigned char RPTIE : 1;
            unsigned char SARIE : 1;
            unsigned char DARIE : 1;
        }
        BIT;
    }
    DMINT;
    union
    {
        unsigned short WORD;
        struct
        {
            unsigned short SM : 2;
            unsigned short : 1;
            unsigned short SARA : 5;
            unsigned short DM : 2;
            unsigned short : 1;
            unsigned short DARA : 5;
        }
        BIT;
    }
    DMAMD;
    char wk2[ 6 ];
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char : 7;
            unsigned char DTE : 1;
        }
        BIT;
    }
    DMCNT;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char : 3;
            unsigned char CLRS : 1;
            unsigned char : 3;
            unsigned char SWREQ : 1;
        }
        BIT;
    }
    DMREQ;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char ACT : 1;
            unsigned char : 2;
            unsigned char DTIF : 1;
            unsigned char : 3;
            unsigned char ESIF : 1;
        }
        BIT;
    }
    DMSTS;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char : 7;
            unsigned char DISEL : 1;
        }
        BIT;
    }
    DMCSL;
};

struct st_dtc
{
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char : 3;
            unsigned char RRS : 1;
        }
        BIT;
    }
    DTCCR;
    char wk0[ 3 ];
    void * DTCVBR;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char : 7;
            unsigned char SHORT : 1;
        }
        BIT;
    }
    DTCADMOD;
    char wk1[ 3 ];
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char : 7;
            unsigned char DTCST : 1;
        }
        BIT;
    }
    DTCST;
    char wk2[ 1 ];
    union
    {
        unsigned short WORD;
        struct
        {
            unsigned short ACT : 1;
            unsigned short : 7;
            unsigned short VECN : 8;
        }
        BIT;
    }
    DTCSTS;
};

