FreeRTOS/FreeRTOS/FreeRTOS/Demo/RX200_RX210-RSK_Renesas/RTOSDemo/include/RX62Niodefine.h
struct st_edmac
{
    union
    {
        unsigned long LONG;
        struct
        {
            unsigned long : 25;
            unsigned long DE : 1;
            unsigned long DL : 2;
            unsigned long : 3;
            unsigned long SWR : 1;
        }
        BIT;
    }
    EDMR;
    char wk0[ 4 ];
    union
    {
        unsigned long LONG;
        struct
        {
            unsigned long : 31;
            unsigned long TR : 1;
        }
        BIT;
    }
    EDTRR;
    char wk1[ 4 ];
    union
    {
        unsigned long LONG;
        struct
        {
            unsigned long : 31;
            unsigned long RR : 1;
        }
        BIT;
    }
    EDRRR;
    char wk2[ 4 ];
    void * TDLAR;
    char wk3[ 4 ];
    void * RDLAR;
    char wk4[ 4 ];
    union
    {
        unsigned long LONG;
        struct
        {
            unsigned long : 1;
            unsigned long TWB : 1;
            unsigned long : 3;
            unsigned long TABT : 1;
            unsigned long RABT : 1;
            unsigned long RFCOF : 1;
            unsigned long ADE : 1;
            unsigned long ECI : 1;
            unsigned long TC : 1;
            unsigned long TDE : 1;
            unsigned long TFUF : 1;
            unsigned long FR : 1;
            unsigned long RDE : 1;
            unsigned long RFOF : 1;
            unsigned long : 4;
            unsigned long CND : 1;
            unsigned long DLC : 1;
            unsigned long CD : 1;
            unsigned long TRO : 1;
            unsigned long RMAF : 1;
            unsigned long : 2;
            unsigned long RRF : 1;
            unsigned long RTLF : 1;
            unsigned long RTSF : 1;
            unsigned long PRE : 1;
            unsigned long CERF : 1;
        }
        BIT;
    }
    EESR;
    char wk5[ 4 ];
    union
    {
        unsigned long LONG;
        struct
        {
            unsigned long : 1;
            unsigned long TWBIP : 1;
            unsigned long : 3;
            unsigned long TABTIP : 1;
            unsigned long RABTIP : 1;
            unsigned long RFCOFIP : 1;
            unsigned long ADEIP : 1;
            unsigned long ECIIP : 1;
            unsigned long TCIP : 1;
            unsigned long TDEIP : 1;
            unsigned long TFUFIP : 1;
            unsigned long FRIP : 1;
            unsigned long RDEIP : 1;
            unsigned long RFOFIP : 1;
            unsigned long : 4;
            unsigned long CNDIP : 1;
            unsigned long DLCIP : 1;
            unsigned long CDIP : 1;
            unsigned long TROIP : 1;
            unsigned long RMAFIP : 1;
            unsigned long : 2;
            unsigned long RRFIP : 1;
            unsigned long RTLFIP : 1;
            unsigned long RTSFIP : 1;
            unsigned long PREIP : 1;
            unsigned long CERFIP : 1;
        }
        BIT;
    }
    EESIPR;
    char wk6[ 4 ];
    union
    {
        unsigned long LONG;
        struct
        {
            unsigned long : 20;
            unsigned long CNDCE : 1;
            unsigned long DLCCE : 1;
            unsigned long CDCE : 1;
            unsigned long TROCE : 1;
            unsigned long RMAFCE : 1;
            unsigned long : 2;
            unsigned long RRFCE : 1;
            unsigned long RTLFCE : 1;
            unsigned long RTSFCE : 1;
            unsigned long PRECE : 1;
            unsigned long CERFCE : 1;
        }
        BIT;
    }
    TRSCER;
    char wk7[ 4 ];
    union
    {
        unsigned long LONG;
        struct
        {
            unsigned long : 16;
            unsigned long MFC : 16;
        }
        BIT;
    }
    RMFCR;
    char wk8[ 4 ];
    union
    {
        unsigned long LONG;
        struct
        {
            unsigned long : 21;
            unsigned long TFT : 11;
        }
        BIT;
    }
    TFTR;
    char wk9[ 4 ];
    union
    {
        unsigned long LONG;
        struct
        {
            unsigned long : 19;
            unsigned long TFD : 5;
            unsigned long : 3;
            unsigned long RFD : 5;
        }
        BIT;
    }
    FDR;
    char wk10[ 4 ];
    union
    {
        unsigned long LONG;
        struct
        {
            unsigned long : 30;
            unsigned long RNC : 1;
            unsigned long RNR : 1;
        }
        BIT;
    }
    RMCR;
    char wk11[ 8 ];
    union
    {
        unsigned long LONG;
        struct
        {
            unsigned long : 16;
            unsigned long UNDER : 16;
        }
        BIT;
    }
    TFUCR;
    union
    {
        unsigned long LONG;
        struct
        {
            unsigned long : 16;
            unsigned long OVER : 16;
        }
        BIT;
    }
    RFOCR;
    union
    {
        unsigned long LONG;
        struct
        {
            unsigned long : 31;
            unsigned long TLB : 1;
        }
        BIT;
    }
    IOSR;
    union
    {
        unsigned long LONG;
        struct
        {
            unsigned long : 13;
            unsigned long RFFO : 3;
            unsigned long : 13;
            unsigned long RFDO : 3;
        }
        BIT;
    }
    FCFTR;
    char wk12[ 4 ];
    union
    {
        unsigned long LONG;
        struct
        {
            unsigned long : 14;
            unsigned long PADS : 2;
            unsigned long : 10;
            unsigned long PADR : 6;
        }
        BIT;
    }
    RPADIR;
    union
    {
        unsigned long LONG;
        struct
        {
            unsigned long : 27;
            unsigned long TIM : 1;
            unsigned long : 3;
            unsigned long TIS : 1;
        }
        BIT;
    }
    TRIMD;
    char wk13[ 72 ];
    void * RBWAR;
    void * RDFAR;
    char wk14[ 4 ];
    void * TBRAR;
    void * TDFAR;
};

struct st_etherc
{
    union
    {
        unsigned long LONG;
        struct
        {
            unsigned long : 11;
            unsigned long TPC : 1;
            unsigned long ZPE : 1;
            unsigned long PFR : 1;
            unsigned long RXF : 1;
            unsigned long TXF : 1;
            unsigned long : 3;
            unsigned long PRCEF : 1;
            unsigned long : 2;
            unsigned long MPDE : 1;
            unsigned long : 2;
            unsigned long RE : 1;
            unsigned long TE : 1;
            unsigned long : 1;
            unsigned long ILB : 1;
            unsigned long RTM : 1;
            unsigned long DM : 1;
            unsigned long PRM : 1;
        }
        BIT;
    }
    ECMR;
    char wk0[ 4 ];
    union
    {
        unsigned long LONG;
        struct
        {
            unsigned long : 20;
            unsigned long RFL : 12;
        }
        BIT;
    }
    RFLR;
    char wk1[ 4 ];
    union
    {
        unsigned long LONG;
        struct
        {
            unsigned long : 26;
            unsigned long BFR : 1;
            unsigned long PSRTO : 1;
            unsigned long : 1;
            unsigned long LCHNG : 1;
            unsigned long MPD : 1;
            unsigned long ICD : 1;
        }
        BIT;
    }
    ECSR;
    char wk2[ 4 ];
    union
    {
        unsigned long LONG;
        struct
        {
            unsigned long : 26;
            unsigned long BFSIPR : 1;
            unsigned long PSRTOIP : 1;
            unsigned long : 1;
            unsigned long LCHNGIP : 1;
            unsigned long MPDIP : 1;
            unsigned long ICDIP : 1;
        }
        BIT;
    }
    ECSIPR;
    char wk3[ 4 ];
    union
    {
        unsigned long LONG;
        struct
        {
            unsigned long : 28;
            unsigned long MDI : 1;
            unsigned long MDO : 1;
            unsigned long MMD : 1;
            unsigned long MDC : 1;
        }
        BIT;
    }
    PIR;
    char wk4[ 4 ];
    union
    {
        unsigned long LONG;
        struct
        {
            unsigned long : 31;
            unsigned long LMON : 1;
        }
        BIT;
    }
    PSR;
    char wk5[ 20 ];
    union
    {
        unsigned long LONG;
        struct
        {
            unsigned long : 12;
            unsigned long RMD : 20;
        }
        BIT;
    }
    RDMLR;
    char wk6[ 12 ];
    union
    {
        unsigned long LONG;
        struct
        {
            unsigned long : 27;
            unsigned long IPG : 5;
        }
        BIT;
    }
    IPGR;
    union
    {
        unsigned long LONG;
        struct
        {
            unsigned long : 16;
            unsigned long AP : 16;
        }
        BIT;
    }
    APR;
    union
    {
        unsigned long LONG;
        struct
        {
            unsigned long : 16;
            unsigned long MP : 16;
        }
        BIT;
    }
    MPR;
    char wk7[ 4 ];
    union
    {
        unsigned long LONG;
        struct
        {
            unsigned long : 24;
            unsigned long RPAUSE : 8;
        }
        BIT;
    }
    RFCF;
    union
    {
        unsigned long LONG;
        struct
        {
            unsigned long : 16;
            unsigned long TPAUSE : 16;
        }
        BIT;
    }
    TPAUSER;
    union
    {
        unsigned long LONG;
        struct
        {
            unsigned long : 24;
            unsigned long TXP : 8;
        }
        BIT;
    }
    TPAUSECR;
    union
    {
        unsigned long LONG;
        struct
        {
            unsigned long : 16;
            unsigned long BCF : 16;
        }
        BIT;
    }
    BCFRR;
    char wk8[ 80 ];
    unsigned long MAHR;
    char wk9[ 4 ];
    union
    {
        unsigned long LONG;
        struct
        {
            unsigned long : 16;
            unsigned long MA : 16;
        }
        BIT;
    }
    MALR;
    char wk10[ 4 ];
    unsigned long TROCR;
    unsigned long CDCR;
    unsigned long LCCR;
    unsigned long CNDCR;
    char wk11[ 4 ];
    unsigned long CEFCR;
    unsigned long FRECR;
    unsigned long TSFRCR;
    unsigned long TLFRCR;
    unsigned long RFCR;
    unsigned long MAFCR;
};

struct st_exdmac
{
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char : 7;
            unsigned char DMST : 1;
        }
        BIT;
    }
    EDMAST;
    char wk0[ 479 ];
    unsigned long CLSBR0;
    unsigned long CLSBR1;
    unsigned long CLSBR2;
    unsigned long CLSBR3;
    unsigned long CLSBR4;
    unsigned long CLSBR5;
    unsigned long CLSBR6;
    unsigned long CLSBR7;
};

struct st_exdmac0
{
    void * EDMSAR;
    void * EDMDAR;
    unsigned long EDMCRA;
    unsigned short EDMCRB;
    char wk0[ 2 ];
    union
    {
        unsigned short WORD;
        struct
        {
            unsigned short MD : 2;
            unsigned short DTS : 2;
            unsigned short : 2;
            unsigned short SZ : 2;
            unsigned short : 6;
            unsigned short DCTG : 2;
        }
        BIT;
    }
    EDMTMD;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char : 4;
            unsigned char DACKS : 1;
            unsigned char DACKE : 1;
            unsigned char DACKW : 1;
        }
        BIT;
    }
    EDMOMD;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char : 3;
            unsigned char DTIE : 1;
            unsigned char ESIE : 1;
            unsigned char RPTIE : 1;
            unsigned char SARIE : 1;
            unsigned char DARIE : 1;
        }
        BIT;
    }
    EDMINT;
    union
    {
        unsigned long LONG;
        struct
        {
            unsigned long : 14;
            unsigned long AMS : 1;
            unsigned long DIR : 1;
            unsigned long SM : 2;
            unsigned long : 1;
            unsigned long SARA : 5;
            unsigned long DM : 2;
            unsigned long : 1;
            unsigned long DARA : 5;
        }
        BIT;
    }
    EDMAMD;
    unsigned long EDMOFR;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char : 7;
            unsigned char DTE : 1;
        }
        BIT;
    }
    EDMCNT;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char : 3;
            unsigned char CLRS : 1;
            unsigned char : 3;
            unsigned char SWREQ : 1;
        }
        BIT;
    }
    EDMREQ;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char ACT : 1;
            unsigned char : 2;
            unsigned char DTIF : 1;
            unsigned char : 3;
            unsigned char ESIF : 1;
        }
        BIT;
    }
    EDMSTS;
    char wk1[ 1 ];
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char : 6;
            unsigned char DREQS : 2;
        }
        BIT;
    }
    EDMRMD;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char : 7;
            unsigned char EREQ : 1;
        }
        BIT;
    }
    EDMERF;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char : 7;
            unsigned char PREQ : 1;
        }
        BIT;
    }
    EDMPRF;
};

struct st_exdmac1
{
    void * EDMSAR;
    void * EDMDAR;
    unsigned long EDMCRA;
    unsigned short EDMCRB;
    char wk0[ 2 ];
    union
    {
        unsigned short WORD;
        struct
        {
            unsigned short MD : 2;
            unsigned short DTS : 2;
            unsigned short : 2;
            unsigned short SZ : 2;
            unsigned short : 6;
            unsigned short DCTG : 2;
        }
        BIT;
    }
    EDMTMD;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char : 4;
            unsigned char DACKS : 1;
            unsigned char DACKE : 1;
            unsigned char DACKW : 1;
        }
        BIT;
    }
    EDMOMD;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char : 3;
            unsigned char DTIE : 1;
            unsigned char ESIE : 1;
            unsigned char RPTIE : 1;
            unsigned char SARIE : 1;
            unsigned char DARIE : 1;
        }
        BIT;
    }
    EDMINT;
    union
    {
        unsigned long LONG;
        struct
        {
            unsigned long : 14;
            unsigned long AMS : 1;
            unsigned long DIR : 1;
            unsigned long SM : 2;
            unsigned long : 1;
            unsigned long SARA : 5;
            unsigned long DM : 2;
            unsigned long : 1;
            unsigned long DARA : 5;
        }
        BIT;
    }
    EDMAMD;
    char wk1[ 4 ];
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char : 7;
            unsigned char DTE : 1;
        }
        BIT;
    }
    EDMCNT;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char : 3;
            unsigned char CLRS : 1;
            unsigned char : 3;
            unsigned char SWREQ : 1;
        }
        BIT;
    }
    EDMREQ;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char ACT : 1;
            unsigned char : 2;
            unsigned char DTIF : 1;
            unsigned char : 3;
            unsigned char ESIF : 1;
        }
        BIT;
    }
    EDMSTS;
    char wk2[ 1 ];
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char : 6;
            unsigned char DREQS : 2;
        }
        BIT;
    }
    EDMRMD;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char : 7;
            unsigned char EREQ : 1;
        }
        BIT;
    }
    EDMERF;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char : 7;
            unsigned char PREQ : 1;
        }
        BIT;
    }
    EDMPRF;
};

