FreeRTOS/FreeRTOS/FreeRTOS/Demo/RX200_RX210-RSK_Renesas/RTOSDemo/include/RX62Niodefine.h
struct st_flash
{
    char wk0[ 1 ];
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char : 6;
            unsigned char FLWE : 2;
        }
        BIT;
    }
    FWEPROR;
    char wk1[ 7799160 ];
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char : 3;
            unsigned char FRDMD : 1;
        }
        BIT;
    }
    FMODR;
    char wk2[ 13 ];
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char ROMAE : 1;
            unsigned char : 2;
            unsigned char CMDLK : 1;
            unsigned char DFLAE : 1;
            unsigned char : 1;
            unsigned char DFLRPE : 1;
            unsigned char DFLWPE : 1;
        }
        BIT;
    }
    FASTAT;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char ROMAEIE : 1;
            unsigned char : 2;
            unsigned char CMDLKIE : 1;
            unsigned char DFLAEIE : 1;
            unsigned char : 1;
            unsigned char DFLRPEIE : 1;
            unsigned char DFLWPEIE : 1;
        }
        BIT;
    }
    FAEINT;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char : 7;
            unsigned char FRDYIE : 1;
        }
        BIT;
    }
    FRDYIE;
    char wk3[ 45 ];
    union
    {
        unsigned short WORD;
        struct
        {
            unsigned short KEY : 8;
            unsigned short DBRE07 : 1;
            unsigned short DBRE06 : 1;
            unsigned short DBRE05 : 1;
            unsigned short DBRE04 : 1;
            unsigned short DBRE03 : 1;
            unsigned short DBRE02 : 1;
            unsigned short DBRE01 : 1;
            unsigned short DBRE00 : 1;
        }
        BIT;
    }
    DFLRE0;
    union
    {
        unsigned short WORD;
        struct
        {
            unsigned short KEY : 8;
            unsigned short DBRE15 : 1;
            unsigned short DBRE14 : 1;
            unsigned short DBRE13 : 1;
            unsigned short DBRE12 : 1;
            unsigned short DBRE11 : 1;
            unsigned short DBRE10 : 1;
            unsigned short DBRE09 : 1;
            unsigned short DBRE08 : 1;
        }
        BIT;
    }
    DFLRE1;
    char wk4[ 12 ];
    union
    {
        unsigned short WORD;
        struct
        {
            unsigned short KEY : 8;
            unsigned short DBWE07 : 1;
            unsigned short DBWE06 : 1;
            unsigned short DBWE05 : 1;
            unsigned short DBWE04 : 1;
            unsigned short DBWE03 : 1;
            unsigned short DBWE02 : 1;
            unsigned short DBWE01 : 1;
            unsigned short DBWE00 : 1;
        }
        BIT;
    }
    DFLWE0;
    union
    {
        unsigned short WORD;
        struct
        {
            unsigned short KEY : 8;
            unsigned short DBWE15 : 1;
            unsigned short DBWE14 : 1;
            unsigned short DBWE13 : 1;
            unsigned short DBWE12 : 1;
            unsigned short DBWE11 : 1;
            unsigned short DBWE10 : 1;
            unsigned short DBWE09 : 1;
            unsigned short DBWE08 : 1;
        }
        BIT;
    }
    DFLWE1;
    union
    {
        unsigned short WORD;
        struct
        {
            unsigned short KEY : 8;
            unsigned short : 7;
            unsigned short FCRME : 1;
        }
        BIT;
    }
    FCURAME;
    char wk5[ 15194 ];
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char FRDY : 1;
            unsigned char ILGLERR : 1;
            unsigned char ERSERR : 1;
            unsigned char PRGERR : 1;
            unsigned char SUSRDY : 1;
            unsigned char : 1;
            unsigned char ERSSPD : 1;
            unsigned char PRGSPD : 1;
        }
        BIT;
    }
    FSTATR0;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char FCUERR : 1;
            unsigned char : 2;
            unsigned char FLOCKST : 1;
        }
        BIT;
    }
    FSTATR1;
    union
    {
        unsigned short WORD;
        struct
        {
            unsigned short FEKEY : 8;
            unsigned short FENTRYD : 1;
            unsigned short : 6;
            unsigned short FENTRY0 : 1;
        }
        BIT;
    }
    FENTRYR;
    union
    {
        unsigned short WORD;
        struct
        {
            unsigned short FPKEY : 8;
            unsigned short : 7;
            unsigned short FPROTCN : 1;
        }
        BIT;
    }
    FPROTR;
    union
    {
        unsigned short WORD;
        struct
        {
            unsigned short FPKEY : 8;
            unsigned short : 7;
            unsigned short FRESET : 1;
        }
        BIT;
    }
    FRESETR;
    char wk6[ 2 ];
    union
    {
        unsigned short WORD;
        struct
        {
            unsigned short CMDR : 8;
            unsigned short PCMDR : 8;
        }
        BIT;
    }
    FCMDR;
    char wk7[ 12 ];
    union
    {
        unsigned short WORD;
        struct
        {
            unsigned short : 15;
            unsigned short ESUSPMD : 1;
        }
        BIT;
    }
    FCPSR;
    union
    {
        unsigned short WORD;
        struct
        {
            unsigned short : 5;
            unsigned short BCADR : 8;
            unsigned short : 2;
            unsigned short BCSIZE : 1;
        }
        BIT;
    }
    DFLBCCNT;
    union
    {
        unsigned short WORD;
        struct
        {
            unsigned short : 8;
            unsigned short PEERRST : 8;
        }
        BIT;
    }
    FPESTAT;
    union
    {
        unsigned short WORD;
        struct
        {
            unsigned short : 15;
            unsigned short BCST : 1;
        }
        BIT;
    }
    DFLBCSTAT;
    char wk8[ 24 ];
    union
    {
        unsigned short WORD;
        struct
        {
            unsigned short : 8;
            unsigned short PCKA : 8;
        }
        BIT;
    }
    PCKAR;
};

struct st_icu
{
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char : 7;
            unsigned char IR : 1;
        }
        BIT;
    }
    IR[ 255 ];
    char wk0[ 1 ];
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char : 7;
            unsigned char DTCE : 1;
        }
        BIT;
    }
    DTCER[ 255 ];
    char wk1[ 1 ];
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char IEN7 : 1;
            unsigned char IEN6 : 1;
            unsigned char IEN5 : 1;
            unsigned char IEN4 : 1;
            unsigned char IEN3 : 1;
            unsigned char IEN2 : 1;
            unsigned char IEN1 : 1;
            unsigned char IEN0 : 1;
        }
        BIT;
    }
    IER[ 32 ];
    char wk2[ 192 ];
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char : 7;
            unsigned char SWINT : 1;
        }
        BIT;
    }
    SWINTR;
    char wk3[ 15 ];
    union
    {
        unsigned short WORD;
        struct
        {
            unsigned short FIEN : 1;
            unsigned short : 7;
            unsigned short FVCT : 8;
        }
        BIT;
    }
    FIR;
    char wk4[ 14 ];
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char : 4;
            unsigned char IPR : 4;
        }
        BIT;
    }
    IPR[ 144 ];
    char wk5[ 112 ];
    unsigned char DMRSR0;
    char wk6[ 3 ];
    unsigned char DMRSR1;
    char wk7[ 3 ];
    unsigned char DMRSR2;
    char wk8[ 3 ];
    unsigned char DMRSR3;
    char wk9[ 243 ];
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char : 4;
            unsigned char IRQMD : 2;
        }
        BIT;
    }
    IRQCR[ 16 ];
    char wk10[ 112 ];
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char : 5;
            unsigned char OSTST : 1;
            unsigned char LVDST : 1;
            unsigned char NMIST : 1;
        }
        BIT;
    }
    NMISR;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char : 5;
            unsigned char OSTEN : 1;
            unsigned char LVDEN : 1;
            unsigned char NMIEN : 1;
        }
        BIT;
    }
    NMIER;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char : 5;
            unsigned char OSTCLR : 1;
            unsigned char : 1;
            unsigned char NMICLR : 1;
        }
        BIT;
    }
    NMICLR;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char : 4;
            unsigned char NMIMD : 1;
        }
        BIT;
    }
    NMICR;
};

struct st_ioport
{
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char CS7E : 1;
            unsigned char CS6E : 1;
            unsigned char CS5E : 1;
            unsigned char CS4E : 1;
            unsigned char CS3E : 1;
            unsigned char CS2E : 1;
            unsigned char CS1E : 1;
            unsigned char CS0E : 1;
        }
        BIT;
    }
    PF0CSE;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char CS7S : 2;
            unsigned char CS6S : 2;
            unsigned char CS5S : 2;
            unsigned char CS4S : 2;
        }
        BIT;
    }
    PF1CSS;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char CS3S : 2;
            unsigned char CS2S : 2;
            unsigned char CS1S : 2;
            unsigned char : 1;
            unsigned char CS0S : 1;
        }
        BIT;
    }
    PF2CSS;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char A23E : 1;
            unsigned char A22E : 1;
            unsigned char A21E : 1;
            unsigned char A20E : 1;
            unsigned char A19E : 1;
            unsigned char A18E : 1;
            unsigned char A17E : 1;
            unsigned char A16E : 1;
        }
        BIT;
    }
    PF3BUS;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char A15E : 1;
            unsigned char A14E : 1;
            unsigned char A13E : 1;
            unsigned char A12E : 1;
            unsigned char A11E : 1;
            unsigned char A10E : 1;
            unsigned char ADRLE : 2;
        }
        BIT;
    }
    PF4BUS;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char WR32BC32E : 1;
            unsigned char WR1BC1E : 1;
            unsigned char DH32E : 1;
            unsigned char DHE : 1;
            unsigned char : 2;
            unsigned char ADRHMS : 1;
        }
        BIT;
    }
    PF5BUS;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char SDCLKE : 1;
            unsigned char DQM1E : 1;
            unsigned char : 1;
            unsigned char MDSDE : 1;
            unsigned char : 2;
            unsigned char WAITS : 2;
        }
        BIT;
    }
    PF6BUS;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char EDMA1S : 2;
            unsigned char EDMA0S : 2;
        }
        BIT;
    }
    PF7DMA;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char ITS15 : 1;
            unsigned char : 1;
            unsigned char ITS13 : 1;
            unsigned char : 1;
            unsigned char ITS11 : 1;
            unsigned char ITS10 : 1;
            unsigned char ITS9 : 1;
            unsigned char ITS8 : 1;
        }
        BIT;
    }
    PF8IRQ;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char ITS7 : 1;
            unsigned char ITS6 : 1;
            unsigned char ITS5 : 1;
            unsigned char ITS4 : 1;
            unsigned char ITS3 : 1;
            unsigned char ITS2 : 1;
            unsigned char ITS1 : 1;
            unsigned char ITS0 : 1;
        }
        BIT;
    }
    PF9IRQ;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char : 7;
            unsigned char ADTRG0S : 1;
        }
        BIT;
    }
    PFAADC;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char : 4;
            unsigned char TMR3S : 1;
            unsigned char TMR2S : 1;
            unsigned char TMR1S : 1;
            unsigned char TMR0S : 1;
        }
        BIT;
    }
    PFBTMR;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char TCLKS : 1;
            unsigned char MTUS6 : 1;
            unsigned char MTUS5 : 1;
            unsigned char MTUS4 : 1;
            unsigned char MTUS3 : 1;
            unsigned char MTUS2 : 1;
            unsigned char MTUS1 : 1;
            unsigned char MTUS0 : 1;
        }
        BIT;
    }
    PFCMTU;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char TCLKS : 1;
            unsigned char MTUS6 : 1;
        }
        BIT;
    }
    PFDMTU;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char EE : 1;
            unsigned char : 2;
            unsigned char PHYMODE : 1;
            unsigned char ENETE3 : 1;
            unsigned char ENETE2 : 1;
            unsigned char ENETE1 : 1;
            unsigned char ENETE0 : 1;
        }
        BIT;
    }
    PFENET;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char : 1;
            unsigned char SCI6S : 1;
            unsigned char : 2;
            unsigned char SCI3S : 1;
            unsigned char SCI2S : 1;
            unsigned char SCI1S : 1;
        }
        BIT;
    }
    PFFSCI;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char SSL3E : 1;
            unsigned char SSL2E : 1;
            unsigned char SSL1E : 1;
            unsigned char SSL0E : 1;
            unsigned char MISOE : 1;
            unsigned char MOSIE : 1;
            unsigned char RSPCKE : 1;
            unsigned char RSPIS : 1;
        }
        BIT;
    }
    PFGSPI;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char SSL3E : 1;
            unsigned char SSL2E : 1;
            unsigned char SSL1E : 1;
            unsigned char SSL0E : 1;
            unsigned char MISOE : 1;
            unsigned char MOSIE : 1;
            unsigned char RSPCKE : 1;
            unsigned char RSPIS : 1;
        }
        BIT;
    }
    PFHSPI;
    char wk0[ 1 ];
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char : 7;
            unsigned char CAN0E : 1;
        }
        BIT;
    }
    PFJCAN;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char : 3;
            unsigned char USBE : 1;
            unsigned char PDHZS : 1;
            unsigned char PUPHZS : 1;
            unsigned char USBMD : 2;
        }
        BIT;
    }
    PFKUSB;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char : 3;
            unsigned char USBE : 1;
            unsigned char PDHZS : 1;
            unsigned char PUPHZS : 1;
            unsigned char USBMD : 2;
        }
        BIT;
    }
    PFLUSB;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char POE7E : 1;
            unsigned char POE6E : 1;
            unsigned char POE5E : 1;
            unsigned char POE4E : 1;
            unsigned char POE3E : 1;
            unsigned char POE2E : 1;
            unsigned char POE1E : 1;
            unsigned char POE0E : 1;
        }
        BIT;
    }
    PFMPOE;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char : 6;
            unsigned char POE9E : 1;
            unsigned char POE8E : 1;
        }
        BIT;
    }
    PFNPOE;
};

