FreeRTOS/FreeRTOS/FreeRTOS/Demo/RX200_RX210-RSK_Renesas/RTOSDemo/include/RX62Niodefine.h
struct st_iwdt
{
    unsigned char IWDTRR;
    char wk0[ 1 ];
    union
    {
        unsigned short WORD;
        struct
        {
            unsigned short : 8;
            unsigned short CKS : 4;
            unsigned short : 2;
            unsigned short TOPS : 2;
        }
        BIT;
    }
    IWDTCR;
    union
    {
        unsigned short WORD;
        struct
        {
            unsigned short : 1;
            unsigned short UNDFF : 1;
            unsigned short CNTVAL : 14;
        }
        BIT;
    }
    IWDTSR;
};

struct st_mtu0
{
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char CCLR : 3;
            unsigned char CKEG : 2;
            unsigned char TPSC : 3;
        }
        BIT;
    }
    TCR;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char : 1;
            unsigned char BFE : 1;
            unsigned char BFB : 1;
            unsigned char BFA : 1;
            unsigned char MD : 4;
        }
        BIT;
    }
    TMDR;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char IOB : 4;
            unsigned char IOA : 4;
        }
        BIT;
    }
    TIORH;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char IOD : 4;
            unsigned char IOC : 4;
        }
        BIT;
    }
    TIORL;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char TTGE : 1;
            unsigned char : 2;
            unsigned char TCIEV : 1;
            unsigned char TGIED : 1;
            unsigned char TGIEC : 1;
            unsigned char TGIEB : 1;
            unsigned char TGIEA : 1;
        }
        BIT;
    }
    TIER;
    unsigned char TSR;
    unsigned short TCNT;
    unsigned short TGRA;
    unsigned short TGRB;
    unsigned short TGRC;
    unsigned short TGRD;
    char wk0[ 16 ];
    unsigned short TGRE;
    unsigned short TGRF;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char : 6;
            unsigned char TGIEF : 1;
            unsigned char TGIEE : 1;
        }
        BIT;
    }
    TIER2;
    char wk1[ 1 ];
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char : 5;
            unsigned char TTSE : 1;
            unsigned char TTSB : 1;
            unsigned char TTSA : 1;
        }
        BIT;
    }
    TBTM;
};

struct st_mtu1
{
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char : 1;
            unsigned char CCLR : 2;
            unsigned char CKEG : 2;
            unsigned char TPSC : 3;
        }
        BIT;
    }
    TCR;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char : 4;
            unsigned char MD : 4;
        }
        BIT;
    }
    TMDR;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char IOB : 4;
            unsigned char IOA : 4;
        }
        BIT;
    }
    TIOR;
    char wk0[ 1 ];
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char TTGE : 1;
            unsigned char : 1;
            unsigned char TCIEU : 1;
            unsigned char TCIEV : 1;
            unsigned char : 2;
            unsigned char TGIEB : 1;
            unsigned char TGIEA : 1;
        }
        BIT;
    }
    TIER;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char TCFD : 1;
        }
        BIT;
    }
    TSR;
    unsigned short TCNT;
    unsigned short TGRA;
    unsigned short TGRB;
    char wk1[ 4 ];
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char : 4;
            unsigned char I2BE : 1;
            unsigned char I2AE : 1;
            unsigned char I1BE : 1;
            unsigned char I1AE : 1;
        }
        BIT;
    }
    TICCR;
};

struct st_mtu2
{
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char : 1;
            unsigned char CCLR : 2;
            unsigned char CKEG : 2;
            unsigned char TPSC : 3;
        }
        BIT;
    }
    TCR;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char : 4;
            unsigned char MD : 4;
        }
        BIT;
    }
    TMDR;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char IOB : 4;
            unsigned char IOA : 4;
        }
        BIT;
    }
    TIOR;
    char wk0[ 1 ];
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char TTGE : 1;
            unsigned char : 1;
            unsigned char TCIEU : 1;
            unsigned char TCIEV : 1;
            unsigned char : 2;
            unsigned char TGIEB : 1;
            unsigned char TGIEA : 1;
        }
        BIT;
    }
    TIER;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char TCFD : 1;
        }
        BIT;
    }
    TSR;
    unsigned short TCNT;
    unsigned short TGRA;
    unsigned short TGRB;
};

struct st_mtu3
{
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char CCLR : 3;
            unsigned char CKEG : 2;
            unsigned char TPSC : 3;
        }
        BIT;
    }
    TCR;
    char wk0[ 1 ];
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char : 2;
            unsigned char BFB : 1;
            unsigned char BFA : 1;
            unsigned char MD : 4;
        }
        BIT;
    }
    TMDR;
    char wk1[ 1 ];
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char IOB : 4;
            unsigned char IOA : 4;
        }
        BIT;
    }
    TIORH;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char IOD : 4;
            unsigned char IOC : 4;
        }
        BIT;
    }
    TIORL;
    char wk2[ 2 ];
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char TTGE : 1;
            unsigned char : 2;
            unsigned char TCIEV : 1;
            unsigned char TGIED : 1;
            unsigned char TGIEC : 1;
            unsigned char TGIEB : 1;
            unsigned char TGIEA : 1;
        }
        BIT;
    }
    TIER;
    char wk3[ 7 ];
    unsigned short TCNT;
    char wk4[ 6 ];
    unsigned short TGRA;
    unsigned short TGRB;
    char wk5[ 8 ];
    unsigned short TGRC;
    unsigned short TGRD;
    char wk6[ 4 ];
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char TCFD : 1;
        }
        BIT;
    }
    TSR;
    char wk7[ 11 ];
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char : 6;
            unsigned char TTSB : 1;
            unsigned char TTSA : 1;
        }
        BIT;
    }
    TBTM;
};

struct st_mtu4
{
    char wk0[ 1 ];
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char CCLR : 3;
            unsigned char CKEG : 2;
            unsigned char TPSC : 3;
        }
        BIT;
    }
    TCR;
    char wk1[ 1 ];
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char : 2;
            unsigned char BFB : 1;
            unsigned char BFA : 1;
            unsigned char MD : 4;
        }
        BIT;
    }
    TMDR;
    char wk2[ 2 ];
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char IOB : 4;
            unsigned char IOA : 4;
        }
        BIT;
    }
    TIORH;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char IOD : 4;
            unsigned char IOC : 4;
        }
        BIT;
    }
    TIORL;
    char wk3[ 1 ];
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char TTGE : 1;
            unsigned char TTGE2 : 1;
            unsigned char : 1;
            unsigned char TCIEV : 1;
            unsigned char TGIED : 1;
            unsigned char TGIEC : 1;
            unsigned char TGIEB : 1;
            unsigned char TGIEA : 1;
        }
        BIT;
    }
    TIER;
    char wk4[ 8 ];
    unsigned short TCNT;
    char wk5[ 8 ];
    unsigned short TGRA;
    unsigned short TGRB;
    char wk6[ 8 ];
    unsigned short TGRC;
    unsigned short TGRD;
    char wk7[ 1 ];
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char TCFD : 1;
        }
        BIT;
    }
    TSR;
    char wk8[ 11 ];
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char : 6;
            unsigned char TTSB : 1;
            unsigned char TTSA : 1;
        }
        BIT;
    }
    TBTM;
    char wk9[ 6 ];
    union
    {
        unsigned short WORD;
        struct
        {
            unsigned short BF : 2;
            unsigned short : 6;
            unsigned short UT4AE : 1;
            unsigned short DT4AE : 1;
            unsigned short UT4BE : 1;
            unsigned short DT4BE : 1;
            unsigned short ITA3AE : 1;
            unsigned short ITA4VE : 1;
            unsigned short ITB3AE : 1;
            unsigned short ITB4VE : 1;
        }
        BIT;
    }
    TADCR;
    char wk10[ 2 ];
    unsigned short TADCORA;
    unsigned short TADCORB;
    unsigned short TADCOBRA;
    unsigned short TADCOBRB;
};

