FreeRTOS/FreeRTOS/FreeRTOS/Demo/RX200_RX210-RSK_Renesas/RTOSDemo/include/RX62Niodefine.h
struct st_mtu5
{
    unsigned short TCNTU;
    unsigned short TGRU;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char : 6;
            unsigned char TPSC : 2;
        }
        BIT;
    }
    TCRU;
    char wk0[ 1 ];
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char : 3;
            unsigned char IOC : 5;
        }
        BIT;
    }
    TIORU;
    char wk1[ 9 ];
    unsigned short TCNTV;
    unsigned short TGRV;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char : 6;
            unsigned char TPSC : 2;
        }
        BIT;
    }
    TCRV;
    char wk2[ 1 ];
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char : 3;
            unsigned char IOC : 5;
        }
        BIT;
    }
    TIORV;
    char wk3[ 9 ];
    unsigned short TCNTW;
    unsigned short TGRW;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char : 6;
            unsigned char TPSC : 2;
        }
        BIT;
    }
    TCRW;
    char wk4[ 1 ];
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char : 3;
            unsigned char IOC : 5;
        }
        BIT;
    }
    TIORW;
    char wk5[ 11 ];
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char : 5;
            unsigned char TGIE5U : 1;
            unsigned char TGIE5V : 1;
            unsigned char TGIE5W : 1;
        }
        BIT;
    }
    TIER;
    char wk6[ 1 ];
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char : 5;
            unsigned char CSTU5 : 1;
            unsigned char CSTV5 : 1;
            unsigned char CSTW5 : 1;
        }
        BIT;
    }
    TSTR;
    char wk7[ 1 ];
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char : 5;
            unsigned char CMPCLR5U : 1;
            unsigned char CMPCLR5V : 1;
            unsigned char CMPCLR5W : 1;
        }
        BIT;
    }
    TCNTCMPCLR;
};

struct st_mtua
{
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char : 2;
            unsigned char OE4D : 1;
            unsigned char OE4C : 1;
            unsigned char OE3D : 1;
            unsigned char OE4B : 1;
            unsigned char OE4A : 1;
            unsigned char OE3B : 1;
        }
        BIT;
    }
    TOER;
    char wk0[ 2 ];
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char : 1;
            unsigned char BDC : 1;
            unsigned char N : 1;
            unsigned char P : 1;
            unsigned char FB : 1;
            unsigned char WF : 1;
            unsigned char VF : 1;
            unsigned char UF : 1;
        }
        BIT;
    }
    TGCR;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char : 1;
            unsigned char PSYE : 1;
            unsigned char : 2;
            unsigned char TOCL : 1;
            unsigned char TOCS : 1;
            unsigned char OLSN : 1;
            unsigned char OLSP : 1;
        }
        BIT;
    }
    TOCR1;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char BF : 2;
            unsigned char OLS3N : 1;
            unsigned char OLS3P : 1;
            unsigned char OLS2N : 1;
            unsigned char OLS2P : 1;
            unsigned char OLS1N : 1;
            unsigned char OLS1P : 1;
        }
        BIT;
    }
    TOCR2;
    char wk1[ 4 ];
    unsigned short TCDR;
    unsigned short TDDR;
    char wk2[ 8 ];
    unsigned short TCNTS;
    unsigned short TCBR;
    char wk3[ 12 ];
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char T3AEN : 1;
            unsigned char T3ACOR : 3;
            unsigned char T4VEN : 1;
            unsigned char T4VCOR : 3;
        }
        BIT;
    }
    TITCR;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char : 1;
            unsigned char T3ACNT : 3;
            unsigned char : 1;
            unsigned char T4VCNT : 3;
        }
        BIT;
    }
    TITCNT;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char : 6;
            unsigned char BTE : 2;
        }
        BIT;
    }
    TBTER;
    char wk4[ 1 ];
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char : 7;
            unsigned char TDER : 1;
        }
        BIT;
    }
    TDER;
    char wk5[ 1 ];
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char : 2;
            unsigned char OLS3N : 1;
            unsigned char OLS3P : 1;
            unsigned char OLS2N : 1;
            unsigned char OLS2P : 1;
            unsigned char OLS1N : 1;
            unsigned char OLS1P : 1;
        }
        BIT;
    }
    TOLBR;
    char wk6[ 41 ];
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char CCE : 1;
            unsigned char : 6;
            unsigned char WRE : 1;
        }
        BIT;
    }
    TWCR;
    char wk7[ 31 ];
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char CST4 : 1;
            unsigned char CST3 : 1;
            unsigned char : 3;
            unsigned char CST2 : 1;
            unsigned char CST1 : 1;
            unsigned char CST0 : 1;
        }
        BIT;
    }
    TSTR;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char SYNC4 : 1;
            unsigned char SYNC3 : 1;
            unsigned char : 3;
            unsigned char SYNC2 : 1;
            unsigned char SYNC1 : 1;
            unsigned char SYNC0 : 1;
        }
        BIT;
    }
    TSYR;
    char wk8[ 2 ];
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char : 7;
            unsigned char RWE : 1;
        }
        BIT;
    }
    TRWER;
};

struct st_poe
{
    union
    {
        unsigned short WORD;
        struct
        {
            unsigned short POE3F : 1;
            unsigned short POE2F : 1;
            unsigned short POE1F : 1;
            unsigned short POE0F : 1;
            unsigned short : 3;
            unsigned short PIE1 : 1;
            unsigned short POE3M : 2;
            unsigned short POE2M : 2;
            unsigned short POE1M : 2;
            unsigned short POE0M : 2;
        }
        BIT;
    }
    ICSR1;
    union
    {
        unsigned short WORD;
        struct
        {
            unsigned short OSF1 : 1;
            unsigned short : 5;
            unsigned short OCE1 : 1;
            unsigned short OIE1 : 1;
        }
        BIT;
    }
    OCSR1;
    union
    {
        unsigned short WORD;
        struct
        {
            unsigned short POE7F : 1;
            unsigned short POE6F : 1;
            unsigned short POE5F : 1;
            unsigned short POE4F : 1;
            unsigned short : 3;
            unsigned short PIE2 : 1;
            unsigned short POE7M : 2;
            unsigned short POE6M : 2;
            unsigned short POE5M : 2;
            unsigned short POE4M : 2;
        }
        BIT;
    }
    ICSR2;
    union
    {
        unsigned short WORD;
        struct
        {
            unsigned short OSF2 : 1;
            unsigned short : 5;
            unsigned short OCE2 : 1;
            unsigned short OIE2 : 1;
        }
        BIT;
    }
    OCSR2;
    union
    {
        unsigned short WORD;
        struct
        {
            unsigned short : 3;
            unsigned short POE8F : 1;
            unsigned short : 2;
            unsigned short POE8E : 1;
            unsigned short PIE3 : 1;
            unsigned short : 6;
            unsigned short POE8M : 2;
        }
        BIT;
    }
    ICSR3;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char : 4;
            unsigned char CH6HIZ : 1;
            unsigned char CH910HIZ : 1;
            unsigned char CH0HIZ : 1;
            unsigned char CH34HIZ : 1;
        }
        BIT;
    }
    SPOER;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char PE7ZE : 1;
            unsigned char PE6ZE : 1;
            unsigned char PE5ZE : 1;
            unsigned char PE4ZE : 1;
            unsigned char PE3ZE : 1;
            unsigned char PE2ZE : 1;
            unsigned char PE1ZE : 1;
            unsigned char PE0ZE : 1;
        }
        BIT;
    }
    POECR1;
    union
    {
        unsigned short WORD;
        struct
        {
            unsigned short : 1;
            unsigned short P1CZEA : 1;
            unsigned short P2CZEA : 1;
            unsigned short P3CZEA : 1;
            unsigned short : 1;
            unsigned short P1CZEB : 1;
            unsigned short P2CZEB : 1;
            unsigned short P3CZEB : 1;
            unsigned short : 1;
            unsigned short P4CZE : 1;
            unsigned short P5CZE : 1;
            unsigned short P6CZE : 1;
        }
        BIT;
    }
    POECR2;
    union
    {
        unsigned short WORD;
        struct
        {
            unsigned short : 3;
            unsigned short POE9F : 1;
            unsigned short : 2;
            unsigned short POE9E : 1;
            unsigned short PIE4 : 1;
            unsigned short : 6;
            unsigned short POE9M : 2;
        }
        BIT;
    }
    ICSR4;
};

