FreeRTOS/FreeRTOS/FreeRTOS/Demo/RX200_RX210-RSK_Renesas/RTOSDemo/include/RX62Niodefine.h
struct st_ppg1
{
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char : 7;
            unsigned char PTRSL : 1;
        }
        BIT;
    }
    PTRSLR;
    char wk0[ 5 ];
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char G3CMS : 2;
            unsigned char G2CMS : 2;
            unsigned char G1CMS : 2;
            unsigned char G0CMS : 2;
        }
        BIT;
    }
    PCR;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char G3INV : 1;
            unsigned char G2INV : 1;
            unsigned char G1INV : 1;
            unsigned char G0INV : 1;
            unsigned char G3NOV : 1;
            unsigned char G2NOV : 1;
            unsigned char G1NOV : 1;
            unsigned char G0NOV : 1;
        }
        BIT;
    }
    PMR;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char NDER31 : 1;
            unsigned char NDER30 : 1;
            unsigned char NDER29 : 1;
            unsigned char NDER28 : 1;
            unsigned char NDER27 : 1;
            unsigned char NDER26 : 1;
            unsigned char NDER25 : 1;
            unsigned char NDER24 : 1;
        }
        BIT;
    }
    NDERH;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char NDER23 : 1;
            unsigned char NDER22 : 1;
            unsigned char NDER21 : 1;
            unsigned char NDER20 : 1;
            unsigned char NDER19 : 1;
            unsigned char NDER18 : 1;
            unsigned char NDER17 : 1;
            unsigned char NDER16 : 1;
        }
        BIT;
    }
    NDERL;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char POD31 : 1;
            unsigned char POD30 : 1;
            unsigned char POD29 : 1;
            unsigned char POD28 : 1;
            unsigned char POD27 : 1;
            unsigned char POD26 : 1;
            unsigned char POD25 : 1;
            unsigned char POD24 : 1;
        }
        BIT;
    }
    PODRH;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char POD23 : 1;
            unsigned char POD22 : 1;
            unsigned char POD21 : 1;
            unsigned char POD20 : 1;
            unsigned char POD19 : 1;
            unsigned char POD18 : 1;
            unsigned char POD17 : 1;
            unsigned char POD16 : 1;
        }
        BIT;
    }
    PODRL;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char NDR31 : 1;
            unsigned char NDR30 : 1;
            unsigned char NDR29 : 1;
            unsigned char NDR28 : 1;
            unsigned char NDR27 : 1;
            unsigned char NDR26 : 1;
            unsigned char NDR25 : 1;
            unsigned char NDR24 : 1;
        }
        BIT;
    }
    NDRH;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char NDR23 : 1;
            unsigned char NDR22 : 1;
            unsigned char NDR21 : 1;
            unsigned char NDR20 : 1;
            unsigned char NDR19 : 1;
            unsigned char NDR18 : 1;
            unsigned char NDR17 : 1;
            unsigned char NDR16 : 1;
        }
        BIT;
    }
    NDRL;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char : 4;
            unsigned char NDR27 : 1;
            unsigned char NDR26 : 1;
            unsigned char NDR25 : 1;
            unsigned char NDR24 : 1;
        }
        BIT;
    }
    NDRH2;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char : 4;
            unsigned char NDR19 : 1;
            unsigned char NDR18 : 1;
            unsigned char NDR17 : 1;
            unsigned char NDR16 : 1;
        }
        BIT;
    }
    NDRL2;
};

struct st_riic
{
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char ICE : 1;
            unsigned char IICRST : 1;
            unsigned char CLO : 1;
            unsigned char SOWP : 1;
            unsigned char SCLO : 1;
            unsigned char SDAO : 1;
            unsigned char SCLI : 1;
            unsigned char SDAI : 1;
        }
        BIT;
    }
    ICCR1;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char BBSY : 1;
            unsigned char MST : 1;
            unsigned char TRS : 1;
            unsigned char : 1;
            unsigned char SP : 1;
            unsigned char RS : 1;
            unsigned char ST : 1;
        }
        BIT;
    }
    ICCR2;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char MTWP : 1;
            unsigned char CKS : 3;
            unsigned char BCWP : 1;
            unsigned char BC : 3;
        }
        BIT;
    }
    ICMR1;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char DLCS : 1;
            unsigned char SDDL : 3;
            unsigned char : 1;
            unsigned char TMOH : 1;
            unsigned char TMOL : 1;
            unsigned char TMOS : 1;
        }
        BIT;
    }
    ICMR2;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char SMBS : 1;
            unsigned char WAIT : 1;
            unsigned char RDRFS : 1;
            unsigned char ACKWP : 1;
            unsigned char ACKBT : 1;
            unsigned char ACKBR : 1;
            unsigned char NF : 2;
        }
        BIT;
    }
    ICMR3;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char FMPE : 1;
            unsigned char SCLE : 1;
            unsigned char NFE : 1;
            unsigned char NACKE : 1;
            unsigned char SALE : 1;
            unsigned char NALE : 1;
            unsigned char MALE : 1;
            unsigned char TMOE : 1;
        }
        BIT;
    }
    ICFER;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char HOAE : 1;
            unsigned char : 1;
            unsigned char DIDE : 1;
            unsigned char : 1;
            unsigned char GCAE : 1;
            unsigned char SAR2E : 1;
            unsigned char SAR1E : 1;
            unsigned char SAR0E : 1;
        }
        BIT;
    }
    ICSER;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char TIE : 1;
            unsigned char TEIE : 1;
            unsigned char RIE : 1;
            unsigned char NAKIE : 1;
            unsigned char SPIE : 1;
            unsigned char STIE : 1;
            unsigned char ALIE : 1;
            unsigned char TMOIE : 1;
        }
        BIT;
    }
    ICIER;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char HOA : 1;
            unsigned char : 1;
            unsigned char DID : 1;
            unsigned char : 1;
            unsigned char GCA : 1;
            unsigned char AAS2 : 1;
            unsigned char AAS1 : 1;
            unsigned char AAS0 : 1;
        }
        BIT;
    }
    ICSR1;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char TDRE : 1;
            unsigned char TEND : 1;
            unsigned char RDRF : 1;
            unsigned char NACKF : 1;
            unsigned char STOP : 1;
            unsigned char START : 1;
            unsigned char AL : 1;
            unsigned char TMOF : 1;
        }
        BIT;
    }
    ICSR2;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char SVA : 7;
            unsigned char SVA0 : 1;
        }
        BIT;
    }
    SARL0;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char : 5;
            unsigned char SVA : 2;
            unsigned char FS : 1;
        }
        BIT;
    }
    SARU0;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char SVA : 7;
            unsigned char SVA0 : 1;
        }
        BIT;
    }
    SARL1;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char : 5;
            unsigned char SVA : 2;
            unsigned char FS : 1;
        }
        BIT;
    }
    SARU1;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char SVA : 7;
            unsigned char SVA0 : 1;
        }
        BIT;
    }
    SARL2;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char : 5;
            unsigned char SVA : 2;
            unsigned char FS : 1;
        }
        BIT;
    }
    SARU2;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char : 3;
            unsigned char BRL : 5;
        }
        BIT;
    }
    ICBRL;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char : 3;
            unsigned char BRH : 5;
        }
        BIT;
    }
    ICBRH;
    unsigned char ICDRT;
    unsigned char ICDRR;
};

struct st_rspi
{
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char SPRIE : 1;
            unsigned char SPE : 1;
            unsigned char SPTIE : 1;
            unsigned char SPEIE : 1;
            unsigned char MSTR : 1;
            unsigned char MODFEN : 1;
            unsigned char TXMD : 1;
            unsigned char SPMS : 1;
        }
        BIT;
    }
    SPCR;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char : 4;
            unsigned char SSLP3 : 1;
            unsigned char SSLP2 : 1;
            unsigned char SSLP1 : 1;
            unsigned char SSLP0 : 1;
        }
        BIT;
    }
    SSLP;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char : 2;
            unsigned char MOIFE : 1;
            unsigned char MOIFV : 1;
            unsigned char : 1;
            unsigned char SPOM : 1;
            unsigned char SPLP2 : 1;
            unsigned char SPLP : 1;
        }
        BIT;
    }
    SPPCR;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char SPRF : 1;
            unsigned char : 1;
            unsigned char SPTEF : 1;
            unsigned char : 1;
            unsigned char PERF : 1;
            unsigned char MODF : 1;
            unsigned char IDLNF : 1;
            unsigned char OVRF : 1;
        }
        BIT;
    }
    SPSR;
    union
    {
        unsigned long LONG;
        struct
        {
            unsigned short H;
            unsigned short L;
        }
        WORD;
    }
    SPDR;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char : 5;
            unsigned char SPSLN : 3;
        }
        BIT;
    }
    SPSCR;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char : 1;
            unsigned char SPECM : 3;
            unsigned char : 1;
            unsigned char SPCP : 3;
        }
        BIT;
    }
    SPSSR;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char SPR7 : 1;
            unsigned char SPR6 : 1;
            unsigned char SPR5 : 1;
            unsigned char SPR4 : 1;
            unsigned char SPR3 : 1;
            unsigned char SPR2 : 1;
            unsigned char SPR1 : 1;
            unsigned char SPR0 : 1;
        }
        BIT;
    }
    SPBR;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char : 2;
            unsigned char SPLW : 1;
            unsigned char SPRDTD : 1;
            unsigned char SLSEL : 2;
            unsigned char SPFC : 2;
        }
        BIT;
    }
    SPDCR;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char : 5;
            unsigned char SCKDL : 3;
        }
        BIT;
    }
    SPCKD;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char : 5;
            unsigned char SLNDL : 3;
        }
        BIT;
    }
    SSLND;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char : 5;
            unsigned char SPNDL : 3;
        }
        BIT;
    }
    SPND;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char : 4;
            unsigned char PTE : 1;
            unsigned char SPIIE : 1;
            unsigned char SPOE : 1;
            unsigned char SPPE : 1;
        }
        BIT;
    }
    SPCR2;
    union
    {
        unsigned short WORD;
        struct
        {
            unsigned short SCKDEN : 1;
            unsigned short SLNDEN : 1;
            unsigned short SPNDEN : 1;
            unsigned short LSBF : 1;
            unsigned short SPB : 4;
            unsigned short SSLKP : 1;
            unsigned short SSLA : 3;
            unsigned short BRDV : 2;
            unsigned short CPOL : 1;
            unsigned short CPHA : 1;
        }
        BIT;
    }
    SPCMD0;
    union
    {
        unsigned short WORD;
        struct
        {
            unsigned short SCKDEN : 1;
            unsigned short SLNDEN : 1;
            unsigned short SPNDEN : 1;
            unsigned short LSBF : 1;
            unsigned short SPB : 4;
            unsigned short SSLKP : 1;
            unsigned short SSLA : 3;
            unsigned short BRDV : 2;
            unsigned short CPOL : 1;
            unsigned short CPHA : 1;
        }
        BIT;
    }
    SPCMD1;
    union
    {
        unsigned short WORD;
        struct
        {
            unsigned short SCKDEN : 1;
            unsigned short SLNDEN : 1;
            unsigned short SPNDEN : 1;
            unsigned short LSBF : 1;
            unsigned short SPB : 4;
            unsigned short SSLKP : 1;
            unsigned short SSLA : 3;
            unsigned short BRDV : 2;
            unsigned short CPOL : 1;
            unsigned short CPHA : 1;
        }
        BIT;
    }
    SPCMD2;
    union
    {
        unsigned short WORD;
        struct
        {
            unsigned short SCKDEN : 1;
            unsigned short SLNDEN : 1;
            unsigned short SPNDEN : 1;
            unsigned short LSBF : 1;
            unsigned short SPB : 4;
            unsigned short SSLKP : 1;
            unsigned short SSLA : 3;
            unsigned short BRDV : 2;
            unsigned short CPOL : 1;
            unsigned short CPHA : 1;
        }
        BIT;
    }
    SPCMD3;
    union
    {
        unsigned short WORD;
        struct
        {
            unsigned short SCKDEN : 1;
            unsigned short SLNDEN : 1;
            unsigned short SPNDEN : 1;
            unsigned short LSBF : 1;
            unsigned short SPB : 4;
            unsigned short SSLKP : 1;
            unsigned short SSLA : 3;
            unsigned short BRDV : 2;
            unsigned short CPOL : 1;
            unsigned short CPHA : 1;
        }
        BIT;
    }
    SPCMD4;
    union
    {
        unsigned short WORD;
        struct
        {
            unsigned short SCKDEN : 1;
            unsigned short SLNDEN : 1;
            unsigned short SPNDEN : 1;
            unsigned short LSBF : 1;
            unsigned short SPB : 4;
            unsigned short SSLKP : 1;
            unsigned short SSLA : 3;
            unsigned short BRDV : 2;
            unsigned short CPOL : 1;
            unsigned short CPHA : 1;
        }
        BIT;
    }
    SPCMD5;
    union
    {
        unsigned short WORD;
        struct
        {
            unsigned short SCKDEN : 1;
            unsigned short SLNDEN : 1;
            unsigned short SPNDEN : 1;
            unsigned short LSBF : 1;
            unsigned short SPB : 4;
            unsigned short SSLKP : 1;
            unsigned short SSLA : 3;
            unsigned short BRDV : 2;
            unsigned short CPOL : 1;
            unsigned short CPHA : 1;
        }
        BIT;
    }
    SPCMD6;
    union
    {
        unsigned short WORD;
        struct
        {
            unsigned short SCKDEN : 1;
            unsigned short SLNDEN : 1;
            unsigned short SPNDEN : 1;
            unsigned short LSBF : 1;
            unsigned short SPB : 4;
            unsigned short SSLKP : 1;
            unsigned short SSLA : 3;
            unsigned short BRDV : 2;
            unsigned short CPOL : 1;
            unsigned short CPHA : 1;
        }
        BIT;
    }
    SPCMD7;
};

