FreeRTOS/FreeRTOS/FreeRTOS/Demo/RX200_RX210-RSK_Renesas/RTOSDemo/include/RX62Niodefine.h
struct st_rtc
{
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char F64HZ : 1;
            unsigned char F32HZ : 1;
            unsigned char F16HZ : 1;
            unsigned char F8HZ : 1;
            unsigned char F4HZ : 1;
            unsigned char F2HZ : 1;
            unsigned char F1HZ : 1;
        }
        BIT;
    }
    R64CNT;
    char wk0[ 1 ];
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char : 1;
            unsigned char SEC10 : 3;
            unsigned char SEC1 : 4;
        }
        BIT;
    }
    RSECCNT;
    char wk1[ 1 ];
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char : 1;
            unsigned char MIN10 : 3;
            unsigned char MIN1 : 4;
        }
        BIT;
    }
    RMINCNT;
    char wk2[ 1 ];
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char : 2;
            unsigned char HOUR10 : 2;
            unsigned char HOUR1 : 4;
        }
        BIT;
    }
    RHRCNT;
    char wk3[ 1 ];
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char : 5;
            unsigned char DAY : 3;
        }
        BIT;
    }
    RWKCNT;
    char wk4[ 1 ];
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char : 2;
            unsigned char DAY10 : 2;
            unsigned char DAY1 : 4;
        }
        BIT;
    }
    RDAYCNT;
    char wk5[ 1 ];
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char : 3;
            unsigned char MON10 : 1;
            unsigned char MON1 : 4;
        }
        BIT;
    }
    RMONCNT;
    char wk6[ 1 ];
    union
    {
        unsigned short WORD;
        struct
        {
            unsigned short YEAR1000 : 4;
            unsigned short YEAR100 : 4;
            unsigned short YEAR10 : 4;
            unsigned short YEAR1 : 4;
        }
        BIT;
    }
    RYRCNT;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char ENB : 1;
            unsigned char SEC10 : 3;
            unsigned char SEC1 : 4;
        }
        BIT;
    }
    RSECAR;
    char wk7[ 1 ];
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char ENB : 1;
            unsigned char MIN10 : 3;
            unsigned char MIN1 : 4;
        }
        BIT;
    }
    RMINAR;
    char wk8[ 1 ];
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char ENB : 1;
            unsigned char : 1;
            unsigned char HOUR10 : 2;
            unsigned char HOUR1 : 4;
        }
        BIT;
    }
    RHRAR;
    char wk9[ 1 ];
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char ENB : 1;
            unsigned char : 4;
            unsigned char DAY : 3;
        }
        BIT;
    }
    RWKAR;
    char wk10[ 1 ];
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char ENB : 1;
            unsigned char : 1;
            unsigned char DAY10 : 2;
            unsigned char DAY1 : 4;
        }
        BIT;
    }
    RDAYAR;
    char wk11[ 1 ];
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char ENB : 1;
            unsigned char : 2;
            unsigned char MON10 : 1;
            unsigned char MON1 : 4;
        }
        BIT;
    }
    RMONAR;
    char wk12[ 1 ];
    union
    {
        unsigned short WORD;
        struct
        {
            unsigned short YEAR1000 : 4;
            unsigned short YEAR100 : 4;
            unsigned short YEAR10 : 4;
            unsigned short YEAR1 : 4;
        }
        BIT;
    }
    RYRAR;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char ENB : 1;
        }
        BIT;
    }
    RYRAREN;
    char wk13[ 3 ];
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char : 1;
            unsigned char PES : 3;
            unsigned char : 1;
            unsigned char PIE : 1;
            unsigned char CIE : 1;
            unsigned char AIE : 1;
        }
        BIT;
    }
    RCR1;
    char wk14[ 1 ];
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char : 4;
            unsigned char RTCOE : 1;
            unsigned char ADJ : 1;
            unsigned char RESET : 1;
            unsigned char START : 1;
        }
        BIT;
    }
    RCR2;
};

struct st_s12ad
{
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char ADST : 1;
            unsigned char ADCS : 1;
            unsigned char : 1;
            unsigned char ADIE : 1;
            unsigned char CKS : 2;
            unsigned char TRGE : 1;
            unsigned char EXTRG : 1;
        }
        BIT;
    }
    ADCSR;
    char wk0[ 3 ];
    union
    {
        unsigned short WORD;
        struct
        {
            unsigned short : 8;
            unsigned short ANS : 8;
        }
        BIT;
    }
    ADANS;
    char wk1[ 2 ];
    union
    {
        unsigned short WORD;
        struct
        {
            unsigned short : 8;
            unsigned short ADS : 8;
        }
        BIT;
    }
    ADADS;
    char wk2[ 2 ];
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char : 6;
            unsigned char ADC : 2;
        }
        BIT;
    }
    ADADC;
    char wk3[ 1 ];
    union
    {
        unsigned short WORD;
        struct
        {
            unsigned short ADRFMT : 1;
            unsigned short : 9;
            unsigned short ACE : 1;
        }
        BIT;
    }
    ADCER;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char : 4;
            unsigned char ADSTRS : 4;
        }
        BIT;
    }
    ADSTRGR;
    char wk4[ 15 ];
    unsigned short ADDR0;
    unsigned short ADDR1;
    unsigned short ADDR2;
    unsigned short ADDR3;
    unsigned short ADDR4;
    unsigned short ADDR5;
    unsigned short ADDR6;
    unsigned short ADDR7;
};

struct st_sci
{
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char CM : 1;
            unsigned char CHR : 1;
            unsigned char PE : 1;
            unsigned char PM : 1;
            unsigned char STOP : 1;
            unsigned char MP : 1;
            unsigned char CKS : 2;
        }
        BIT;
    }
    SMR;
    unsigned char BRR;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char TIE : 1;
            unsigned char RIE : 1;
            unsigned char TE : 1;
            unsigned char RE : 1;
            unsigned char MPIE : 1;
            unsigned char TEIE : 1;
            unsigned char CKE : 2;
        }
        BIT;
    }
    SCR;
    unsigned char TDR;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char TDRE : 1;
            unsigned char RDRF : 1;
            unsigned char ORER : 1;
            unsigned char FER : 1;
            unsigned char PER : 1;
            unsigned char TEND : 1;
            unsigned char MPB : 1;
            unsigned char MPBT : 1;
        }
        BIT;
    }
    SSR;
    unsigned char RDR;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char : 4;
            unsigned char SDIR : 1;
            unsigned char SINV : 1;
            unsigned char : 1;
            unsigned char SMIF : 1;
        }
        BIT;
    }
    SCMR;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char : 3;
            unsigned char ABCS : 1;
            unsigned char : 3;
            unsigned char ACS0 : 1;
        }
        BIT;
    }
    SEMR;
};

struct st_smci
{
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char GM : 1;
            unsigned char BLK : 1;
            unsigned char PE : 1;
            unsigned char PM : 1;
            unsigned char BCP : 2;
            unsigned char CKS : 2;
        }
        BIT;
    }
    SMR;
    unsigned char BRR;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char TIE : 1;
            unsigned char RIE : 1;
            unsigned char TE : 1;
            unsigned char RE : 1;
            unsigned char : 1;
            unsigned char TEIE : 1;
            unsigned char CKE : 2;
        }
        BIT;
    }
    SCR;
    unsigned char TDR;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char TDRE : 1;
            unsigned char RDRF : 1;
            unsigned char ORER : 1;
            unsigned char ERS : 1;
            unsigned char PER : 1;
            unsigned char TEND : 1;
        }
        BIT;
    }
    SSR;
    unsigned char RDR;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char BCP2 : 1;
            unsigned char : 3;
            unsigned char SDIR : 1;
            unsigned char SINV : 1;
            unsigned char : 1;
            unsigned char SMIF : 1;
        }
        BIT;
    }
    SCMR;
};

struct st_system
{
    union
    {
        unsigned short WORD;
        struct
        {
            unsigned short : 8;
            unsigned short MDE : 1;
            unsigned short : 5;
            unsigned short MD1 : 1;
            unsigned short MD0 : 1;
        }
        BIT;
    }
    MDMONR;
    union
    {
        unsigned short WORD;
        struct
        {
            unsigned short : 9;
            unsigned short UBTS : 1;
            unsigned short : 1;
            unsigned short BOTS : 1;
            unsigned short BSW : 2;
            unsigned short EXB : 1;
            unsigned short IROM : 1;
        }
        BIT;
    }
    MDSR;
    char wk0[ 2 ];
    union
    {
        unsigned short WORD;
        struct
        {
            unsigned short KEY : 8;
            unsigned short : 6;
            unsigned short EXBE : 1;
            unsigned short ROME : 1;
        }
        BIT;
    }
    SYSCR0;
    union
    {
        unsigned short WORD;
        struct
        {
            unsigned short : 15;
            unsigned short RAME : 1;
        }
        BIT;
    }
    SYSCR1;
    char wk1[ 2 ];
    union
    {
        unsigned short WORD;
        struct
        {
            unsigned short SSBY : 1;
            unsigned short OPE : 1;
            unsigned short : 1;
            unsigned short STS : 5;
        }
        BIT;
    }
    SBYCR;
    char wk2[ 2 ];
    union
    {
        unsigned long LONG;
        struct
        {
            unsigned long ACSE : 1;
            unsigned long : 1;
            unsigned long MSTPA29 : 1;
            unsigned long MSTPA28 : 1;
            unsigned long : 4;
            unsigned long MSTPA23 : 1;
            unsigned long MSTPA22 : 1;
            unsigned long : 2;
            unsigned long MSTPA19 : 1;
            unsigned long : 1;
            unsigned long MSTPA17 : 1;
            unsigned long : 1;
            unsigned long MSTPA15 : 1;
            unsigned long MSTPA14 : 1;
            unsigned long : 2;
            unsigned long MSTPA11 : 1;
            unsigned long MSTPA10 : 1;
            unsigned long MSTPA9 : 1;
            unsigned long MSTPA8 : 1;
            unsigned long : 2;
            unsigned long MSTPA5 : 1;
            unsigned long MSTPA4 : 1;
        }
        BIT;
    }
    MSTPCRA;
    union
    {
        unsigned long LONG;
        struct
        {
            unsigned long MSTPB31 : 1;
            unsigned long MSTPB30 : 1;
            unsigned long MSTPB29 : 1;
            unsigned long MSTPB28 : 1;
            unsigned long : 1;
            unsigned long MSTPB26 : 1;
            unsigned long MSTPB25 : 1;
            unsigned long : 1;
            unsigned long MSTPB23 : 1;
            unsigned long : 1;
            unsigned long MSTPB21 : 1;
            unsigned long MSTPB20 : 1;
            unsigned long MSTPB19 : 1;
            unsigned long MSTPB18 : 1;
            unsigned long MSTPB17 : 1;
            unsigned long MSTPB16 : 1;
            unsigned long MSTPB15 : 1;
            unsigned long : 14;
            unsigned long MSTPB0 : 1;
        }
        BIT;
    }
    MSTPCRB;
    union
    {
        unsigned long LONG;
        struct
        {
            unsigned long : 30;
            unsigned long MSTPC1 : 1;
            unsigned long MSTPC0 : 1;
        }
        BIT;
    }
    MSTPCRC;
    char wk3[ 4 ];
    union
    {
        unsigned long LONG;
        struct
        {
            unsigned long : 4;
            unsigned long ICK : 4;
            unsigned long PSTOP1 : 1;
            unsigned long PSTOP0 : 1;
            unsigned long : 2;
            unsigned long BCK : 4;
            unsigned long : 4;
            unsigned long PCK : 4;
        }
        BIT;
    }
    SCKCR;
    char wk4[ 12 ];
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char : 7;
            unsigned char BCLKDIV : 1;
        }
        BIT;
    }
    BCKCR;
    char wk5[ 15 ];
    union
    {
        unsigned short WORD;
        struct
        {
            unsigned short KEY : 8;
            unsigned short OSTDE : 1;
            unsigned short OSTDF : 1;
        }
        BIT;
    }
    OSTDCR;
    char wk6[ 49726 ];
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char DPSBY : 1;
            unsigned char IOKEEP : 1;
            unsigned char RAMCUT2 : 1;
            unsigned char RAMCUT1 : 1;
            unsigned char : 3;
            unsigned char RAMCUT0 : 1;
        }
        BIT;
    }
    DPSBYCR;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char : 2;
            unsigned char WTSTS : 6;
        }
        BIT;
    }
    DPSWCR;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char DNMIE : 1;
            unsigned char DUSBE : 1;
            unsigned char DRTCE : 1;
            unsigned char DLVDE : 1;
            unsigned char DIRQ3E : 1;
            unsigned char DIRQ2E : 1;
            unsigned char DIRQ1E : 1;
            unsigned char DIRQ0E : 1;
        }
        BIT;
    }
    DPSIER;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char DNMIF : 1;
            unsigned char DUSBF : 1;
            unsigned char DRTCFF : 1;
            unsigned char DLVDF : 1;
            unsigned char DIRQ3F : 1;
            unsigned char DIRQ2F : 1;
            unsigned char DIRQ1F : 1;
            unsigned char DIRQ0F : 1;
        }
        BIT;
    }
    DPSIFR;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char DNMIEG : 1;
            unsigned char : 3;
            unsigned char DIRQ3EG : 1;
            unsigned char DIRQ2EG : 1;
            unsigned char DIRQ1EG : 1;
            unsigned char DIRQ0EG : 1;
        }
        BIT;
    }
    DPSIEGR;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char DPSRSTF : 1;
            unsigned char : 4;
            unsigned char LVD2F : 1;
            unsigned char LVD1F : 1;
            unsigned char PORF : 1;
        }
        BIT;
    }
    RSTSR;
    char wk7[ 4 ];
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char : 7;
            unsigned char SUBSTOP : 1;
        }
        BIT;
    }
    SUBOSCCR;
    char wk8[ 1 ];
    unsigned char LVDKEYR;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char LVD2E : 1;
            unsigned char LVD2RI : 1;
            unsigned char : 2;
            unsigned char LVD1E : 1;
            unsigned char LVD1RI : 1;
        }
        BIT;
    }
    LVDCR;
    char wk9[ 2 ];
    unsigned char DPSBKR[ 32 ];
};

struct st_tmr0
{
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char CMIEB : 1;
            unsigned char CMIEA : 1;
            unsigned char OVIE : 1;
            unsigned char CCLR : 2;
        }
        BIT;
    }
    TCR;
    char wk0[ 1 ];
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char : 3;
            unsigned char ADTE : 1;
            unsigned char OSB : 2;
            unsigned char OSA : 2;
        }
        BIT;
    }
    TCSR;
    char wk1[ 1 ];
    unsigned char TCORA;
    char wk2[ 1 ];
    unsigned char TCORB;
    char wk3[ 1 ];
    unsigned char TCNT;
    char wk4[ 1 ];
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char TMRIS : 1;
            unsigned char : 2;
            unsigned char CSS : 2;
            unsigned char CKS : 3;
        }
        BIT;
    }
    TCCR;
};

