FreeRTOS/FreeRTOS/FreeRTOS/Demo/RX200_RX210-RSK_Renesas/RTOSDemo/include/RX62Niodefine.h
enum enum_ir
{
    IR_BSC_BUSERR = 16, IR_FCU_FIFERR = 21, IR_FCU_FRDYI = 23,
    IR_ICU_SWINT = 27,
    IR_CMT0_CMI0,
    IR_CMT1_CMI1,
    IR_CMT2_CMI2,
    IR_CMT3_CMI3,
    IR_ETHER_EINT,
    IR_USB0_D0FIFO0 = 36, IR_USB0_D1FIFO0, IR_USB0_USBI0,
    IR_USB1_D0FIFO1 = 40, IR_USB1_D1FIFO1, IR_USB1_USBI1,
    IR_RSPI0_SPEI0 = 44, IR_RSPI0_SPRI0, IR_RSPI0_SPTI0, IR_RSPI0_SPII0,
    IR_RSPI1_SPEI1, IR_RSPI1_SPRI1, IR_RSPI1_SPTI1, IR_RSPI1_SPII1,
    IR_CAN0_ERS0 = 56, IR_CAN0_RXF0, IR_CAN0_TXF0, IR_CAN0_RXM0, IR_CAN0_TXM0,
    IR_RTC_PRD = 62, IR_RTC_CUP,
    IR_ICU_IRQ0, IR_ICU_IRQ1, IR_ICU_IRQ2, IR_ICU_IRQ3, IR_ICU_IRQ4, IR_ICU_IRQ5, IR_ICU_IRQ6, IR_ICU_IRQ7, IR_ICU_IRQ8, IR_ICU_IRQ9, IR_ICU_IRQ10, IR_ICU_IRQ11, IR_ICU_IRQ12, IR_ICU_IRQ13, IR_ICU_IRQ14, IR_ICU_IRQ15,
    IR_USB_USBR0 = 90, IR_USB_USBR1,
    IR_RTC_ALM,
    IR_WDT_WOVI = 96,
    IR_AD0_ADI0 = 98,
    IR_AD1_ADI1,
    IR_S12AD_ADI = 102,
    IR_MTU0_TGIA0 = 114, IR_MTU0_TGIB0, IR_MTU0_TGIC0, IR_MTU0_TGID0, IR_MTU0_TCIV0, IR_MTU0_TGIE0, IR_MTU0_TGIF0,
    IR_MTU1_TGIA1, IR_MTU1_TGIB1, IR_MTU1_TCIV1, IR_MTU1_TCIU1,
    IR_MTU2_TGIA2, IR_MTU2_TGIB2, IR_MTU2_TCIV2, IR_MTU2_TCIU2,
    IR_MTU3_TGIA3, IR_MTU3_TGIB3, IR_MTU3_TGIC3, IR_MTU3_TGID3, IR_MTU3_TCIV3,
    IR_MTU4_TGIA4, IR_MTU4_TGIB4, IR_MTU4_TGIC4, IR_MTU4_TGID4, IR_MTU4_TCIV4,
    IR_MTU5_TGIU5, IR_MTU5_TGIV5, IR_MTU5_TGIW5,
    IR_MTU6_TGIA6, IR_MTU6_TGIB6, IR_MTU6_TGIC6, IR_MTU6_TGID6, IR_MTU6_TCIV6, IR_MTU6_TGIE6, IR_MTU6_TGIF6,
    IR_MTU7_TGIA7, IR_MTU7_TGIB7, IR_MTU7_TCIV7, IR_MTU7_TCIU7,
    IR_MTU8_TGIA8, IR_MTU8_TGIB8, IR_MTU8_TCIV8, IR_MTU8_TCIU8,
    IR_MTU9_TGIA9, IR_MTU9_TGIB9, IR_MTU9_TGIC9, IR_MTU9_TGID9, IR_MTU9_TCIV9,
    IR_MTU10_TGIA10, IR_MTU10_TGIB10, IR_MTU10_TGIC10, IR_MTU10_TGID10, IR_MTU10_TCIV10,
    IR_MTU11_TGIU11, IR_MTU11_TGIV11, IR_MTU11_TGIW11,
    IR_POE_OEI1, IR_POE_OEI2, IR_POE_OEI3, IR_POE_OEI4,
    IR_TMR0_CMIA0, IR_TMR0_CMIB0, IR_TMR0_OVI0,
    IR_TMR1_CMIA1, IR_TMR1_CMIB1, IR_TMR1_OVI1,
    IR_TMR2_CMIA2, IR_TMR2_CMIB2, IR_TMR2_OVI2,
    IR_TMR3_CMIA3, IR_TMR3_CMIB3, IR_TMR3_OVI3,
    IR_DMAC_DMAC0I = 198, IR_DMAC_DMAC1I, IR_DMAC_DMAC2I, IR_DMAC_DMAC3I,
    IR_EXDMAC_EXDMAC0I, IR_EXDMAC_EXDMAC1I,
    IR_SCI0_ERI0 = 214, IR_SCI0_RXI0, IR_SCI0_TXI0, IR_SCI0_TEI0,
    IR_SCI1_ERI1, IR_SCI1_RXI1, IR_SCI1_TXI1, IR_SCI1_TEI1,
    IR_SCI2_ERI2, IR_SCI2_RXI2, IR_SCI2_TXI2, IR_SCI2_TEI2,
    IR_SCI3_ERI3, IR_SCI3_RXI3, IR_SCI3_TXI3, IR_SCI3_TEI3,
    IR_SCI5_ERI5 = 234, IR_SCI5_RXI5, IR_SCI5_TXI5, IR_SCI5_TEI5,
    IR_SCI6_ERI6, IR_SCI6_RXI6, IR_SCI6_TXI6, IR_SCI6_TEI6,
    IR_RIIC0_ICEEI0 = 246, IR_RIIC0_ICRXI0, IR_RIIC0_ICTXI0, IR_RIIC0_ICTEI0,
    IR_RIIC1_ICEEI1, IR_RIIC1_ICRXI1, IR_RIIC1_ICTXI1, IR_RIIC1_ICTEI1
};

enum enum_dtce
{
    DTCE_ICU_SWINT = 27,
    DTCE_CMT0_CMI0,
    DTCE_CMT1_CMI1,
    DTCE_CMT2_CMI2,
    DTCE_CMT3_CMI3,
    DTCE_USB0_D0FIFO0 = 36, DTCE_USB0_D1FIFO0,
    DTCE_USB1_D0FIFO1 = 40, DTCE_USB1_D1FIFO1,
    DTCE_RSPI0_SPRI0 = 45, DTCE_RSPI0_SPTI0,
    DTCE_RSPI1_SPRI1 = 49, DTCE_RSPI1_SPTI1,
    DTCE_ICU_IRQ0 = 64, DTCE_ICU_IRQ1, DTCE_ICU_IRQ2, DTCE_ICU_IRQ3, DTCE_ICU_IRQ4, DTCE_ICU_IRQ5, DTCE_ICU_IRQ6, DTCE_ICU_IRQ7, DTCE_ICU_IRQ8, DTCE_ICU_IRQ9, DTCE_ICU_IRQ10, DTCE_ICU_IRQ11, DTCE_ICU_IRQ12, DTCE_ICU_IRQ13, DTCE_ICU_IRQ14, DTCE_ICU_IRQ15,
    DTCE_AD0_ADI0 = 98,
    DTCE_AD1_ADI1,
    DTCE_S12AD_ADI = 102,
    DTCE_MTU0_TGIA0 = 114, DTCE_MTU0_TGIB0, DTCE_MTU0_TGIC0, DTCE_MTU0_TGID0,
    DTCE_MTU1_TGIA1 = 121, DTCE_MTU1_TGIB1,
    DTCE_MTU2_TGIA2 = 125, DTCE_MTU2_TGIB2,
    DTCE_MTU3_TGIA3 = 129, DTCE_MTU3_TGIB3, DTCE_MTU3_TGIC3, DTCE_MTU3_TGID3,
    DTCE_MTU4_TGIA4 = 134, DTCE_MTU4_TGIB4, DTCE_MTU4_TGIC4, DTCE_MTU4_TGID4, DTCE_MTU4_TCIV4,
    DTCE_MTU5_TGIU5, DTCE_MTU5_TGIV5, DTCE_MTU5_TGIW5,
    DTCE_MTU6_TGIA6, DTCE_MTU6_TGIB6, DTCE_MTU6_TGIC6, DTCE_MTU6_TGID6,
    DTCE_MTU7_TGIA7 = 149, DTCE_MTU7_TGIB7,
    DTCE_MTU8_TGIA8 = 153, DTCE_MTU8_TGIB8,
    DTCE_MTU9_TGIA9 = 157, DTCE_MTU9_TGIB9, DTCE_MTU9_TGIC9, DTCE_MTU9_TGID9,
    DTCE_MTU10_TGIA10 = 162, DTCE_MTU10_TGIB10, DTCE_MTU10_TGIC10, DTCE_MTU10_TGID10, DTCE_MTU10_TCIV10,
    DTCE_MTU11_TGIU11, DTCE_MTU11_TGIV11, DTCE_MTU11_TGIW11,
    DTCE_TMR0_CMIA0 = 174, DTCE_TMR0_CMIB0,
    DTCE_TMR1_CMIA1 = 177, DTCE_TMR1_CMIB1,
    DTCE_TMR2_CMIA2 = 180, DTCE_TMR2_CMIB2,
    DTCE_TMR3_CMIA3 = 183, DTCE_TMR3_CMIB3,
    DTCE_DMAC_DMAC0I = 198, DTCE_DMAC_DMAC1I, DTCE_DMAC_DMAC2I, DTCE_DMAC_DMAC3I,
    DTCE_EXDMAC_EXDMAC0I, DTCE_EXDMAC_EXDMAC1I,
    DTCE_SCI0_RXI0 = 215, DTCE_SCI0_TXI0,
    DTCE_SCI1_RXI1 = 219, DTCE_SCI1_TXI1,
    DTCE_SCI2_RXI2 = 223, DTCE_SCI2_TXI2,
    DTCE_SCI3_RXI3 = 227, DTCE_SCI3_TXI3,
    DTCE_SCI5_RXI5 = 235, DTCE_SCI5_TXI5,
    DTCE_SCI6_RXI6 = 239, DTCE_SCI6_TXI6,
    DTCE_RIIC0_ICRXI0 = 247, DTCE_RIIC0_ICTXI0,
    DTCE_RIIC1_ICRXI1 = 251, DTCE_RIIC1_ICTXI1
};

enum enum_ier
{
    IER_BSC_BUSERR = 0x02,
    IER_FCU_FIFERR = 0x02, IER_FCU_FRDYI = 0x02,
    IER_ICU_SWINT = 0x03,
    IER_CMT0_CMI0 = 0x03,
    IER_CMT1_CMI1 = 0x03,
    IER_CMT2_CMI2 = 0x03,
    IER_CMT3_CMI3 = 0x03,
    IER_ETHER_EINT = 0x04,
    IER_USB0_D0FIFO0 = 0x04, IER_USB0_D1FIFO0 = 0x04, IER_USB0_USBI0 = 0x04,
    IER_USB1_D0FIFO1 = 0x05, IER_USB1_D1FIFO1 = 0x05, IER_USB1_USBI1 = 0x05,
    IER_RSPI0_SPEI0 = 0x05, IER_RSPI0_SPRI0 = 0x05, IER_RSPI0_SPTI0 = 0x05, IER_RSPI0_SPII0 = 0x05,
    IER_RSPI1_SPEI1 = 0x06, IER_RSPI1_SPRI1 = 0x06, IER_RSPI1_SPTI1 = 0x06, IER_RSPI1_SPII1 = 0x06,
    IER_CAN0_ERS0 = 0x07, IER_CAN0_RXF0 = 0x07, IER_CAN0_TXF0 = 0x07, IER_CAN0_RXM0 = 0x07, IER_CAN0_TXM0 = 0x07,
    IER_RTC_PRD = 0x07, IER_RTC_CUP = 0x07,
    IER_ICU_IRQ0 = 0x08, IER_ICU_IRQ1 = 0x08, IER_ICU_IRQ2 = 0x08, IER_ICU_IRQ3 = 0x08, IER_ICU_IRQ4 = 0x08, IER_ICU_IRQ5 = 0x08, IER_ICU_IRQ6 = 0x08, IER_ICU_IRQ7 = 0x08, IER_ICU_IRQ8 = 0x09, IER_ICU_IRQ9 = 0x09, IER_ICU_IRQ10 = 0x09, IER_ICU_IRQ11 = 0x09, IER_ICU_IRQ12 = 0x09, IER_ICU_IRQ13 = 0x09, IER_ICU_IRQ14 = 0x09, IER_ICU_IRQ15 = 0x09,
    IER_USB_USBR0 = 0x0B, IER_USB_USBR1 = 0x0B,
    IER_RTC_ALM = 0x0B,
    IER_WDT_WOVI = 0x0C,
    IER_AD0_ADI0 = 0x0C,
    IER_AD1_ADI1 = 0x0C,
    IER_S12AD_ADI = 0x0C,
    IER_MTU0_TGIA0 = 0x0E, IER_MTU0_TGIB0 = 0x0E, IER_MTU0_TGIC0 = 0x0E, IER_MTU0_TGID0 = 0x0E, IER_MTU0_TCIV0 = 0x0E, IER_MTU0_TGIE0 = 0x0E, IER_MTU0_TGIF0 = 0x0F,
    IER_MTU1_TGIA1 = 0x0F, IER_MTU1_TGIB1 = 0x0F, IER_MTU1_TCIV1 = 0x0F, IER_MTU1_TCIU1 = 0x0F,
    IER_MTU2_TGIA2 = 0x0F, IER_MTU2_TGIB2 = 0x0F, IER_MTU2_TCIV2 = 0x0F, IER_MTU2_TCIU2 = 0x10,
    IER_MTU3_TGIA3 = 0x10, IER_MTU3_TGIB3 = 0x10, IER_MTU3_TGIC3 = 0x10, IER_MTU3_TGID3 = 0x10, IER_MTU3_TCIV3 = 0x10,
    IER_MTU4_TGIA4 = 0x10, IER_MTU4_TGIB4 = 0x10, IER_MTU4_TGIC4 = 0x11, IER_MTU4_TGID4 = 0x11, IER_MTU4_TCIV4 = 0x11,
    IER_MTU5_TGIU5 = 0x11, IER_MTU5_TGIV5 = 0x11, IER_MTU5_TGIW5 = 0x10,
    IER_MTU6_TGIA6 = 0x11, IER_MTU6_TGIB6 = 0x11, IER_MTU6_TGIC6 = 0x12, IER_MTU6_TGID6 = 0x12, IER_MTU6_TCIV6 = 0x12, IER_MTU6_TGIE6 = 0x12, IER_MTU6_TGIF6 = 0x12,
    IER_MTU7_TGIA7 = 0x12, IER_MTU7_TGIB7 = 0x12, IER_MTU7_TCIV7 = 0x12, IER_MTU7_TCIU7 = 0x13,
    IER_MTU8_TGIA8 = 0x13, IER_MTU8_TGIB8 = 0x13, IER_MTU8_TCIV8 = 0x13, IER_MTU8_TCIU8 = 0x13,
    IER_MTU9_TGIA9 = 0x13, IER_MTU9_TGIB9 = 0x13, IER_MTU9_TGIC9 = 0x13, IER_MTU9_TGID9 = 0x14, IER_MTU9_TCIV9 = 0x14,
    IER_MTU10_TGIA10 = 0x14, IER_MTU10_TGIB10 = 0x14, IER_MTU10_TGIC10 = 0x14, IER_MTU10_TGID10 = 0x14, IER_MTU10_TCIV10 = 0x14,
    IER_MTU11_TGIU11 = 0x14, IER_MTU11_TGIV11 = 0x15, IER_MTU11_TGIW11 = 0x15,
    IER_POE_OEI1 = 0x15, IER_POE_OEI2 = 0x15, IER_POE_OEI3 = 0x15, IER_POE_OEI4 = 0x15,
    IER_TMR0_CMIA0 = 0x15, IER_TMR0_CMIB0 = 0x15, IER_TMR0_OVI0 = 0x16,
    IER_TMR1_CMIA1 = 0x16, IER_TMR1_CMIB1 = 0x16, IER_TMR1_OVI1 = 0x16,
    IER_TMR2_CMIA2 = 0x16, IER_TMR2_CMIB2 = 0x16, IER_TMR2_OVI2 = 0x16,
    IER_TMR3_CMIA3 = 0x16, IER_TMR3_CMIB3 = 0x17, IER_TMR3_OVI3 = 0x17,
    IER_DMAC_DMAC0I = 0x18, IER_DMAC_DMAC1I = 0x18, IER_DMAC_DMAC2I = 0x19, IER_DMAC_DMAC3I = 0x19,
    IER_EXDMAC_EXDMAC0I = 0x19, IER_EXDMAC_EXDMAC1I = 0x19,
    IER_SCI0_ERI0 = 0x1A, IER_SCI0_RXI0 = 0x1A, IER_SCI0_TXI0 = 0x1B, IER_SCI0_TEI0 = 0x1B,
    IER_SCI1_ERI1 = 0x1B, IER_SCI1_RXI1 = 0x1B, IER_SCI1_TXI1 = 0x1B, IER_SCI1_TEI1 = 0x1B,
    IER_SCI2_ERI2 = 0x1B, IER_SCI2_RXI2 = 0x1B, IER_SCI2_TXI2 = 0x1C, IER_SCI2_TEI2 = 0x1C,
    IER_SCI3_ERI3 = 0x1C, IER_SCI3_RXI3 = 0x1C, IER_SCI3_TXI3 = 0x1C, IER_SCI3_TEI3 = 0x1C,
    IER_SCI5_ERI5 = 0x1D, IER_SCI5_RXI5 = 0x1D, IER_SCI5_TXI5 = 0x1D, IER_SCI5_TEI5 = 0x1D,
    IER_SCI6_ERI6 = 0x1D, IER_SCI6_RXI6 = 0x1D, IER_SCI6_TXI6 = 0x1E, IER_SCI6_TEI6 = 0x1E,
    IER_RIIC0_ICEEI0 = 0x1E, IER_RIIC0_ICRXI0 = 0x1E, IER_RIIC0_ICTXI0 = 0x1F, IER_RIIC0_ICTEI0 = 0x1F,
    IER_RIIC1_ICEEI1 = 0x1F, IER_RIIC1_ICRXI1 = 0x1F, IER_RIIC1_ICTXI1 = 0x1F, IER_RIIC1_ICTEI1 = 0x1F
};

enum enum_ipr
{
    IPR_BSC_BUSERR = 0x00,
    IPR_FCU_FIFERR = 0x01, IPR_FCU_FRDYI = 0x02,
    IPR_ICU_SWINT = 0x03,
    IPR_CMT0_CMI0 = 0x04,
    IPR_CMT1_CMI1 = 0x05,
    IPR_CMT2_CMI2 = 0x06,
    IPR_CMT3_CMI3 = 0x07,
    IPR_ETHER_EINT = 0x08,
    IPR_USB0_D0FIFO0 = 0x0C, IPR_USB0_D1FIFO0 = 0x0D, IPR_USB0_USBI0 = 0x0E,
    IPR_USB1_D0FIFO1 = 0x10, IPR_USB1_D1FIFO1 = 0x11, IPR_USB1_USBI1 = 0x12,
    IPR_RSPI0_SPEI0 = 0x14, IPR_RSPI0_SPRI0 = 0x14, IPR_RSPI0_SPTI0 = 0x14, IPR_RSPI0_SPII0 = 0x14,
    IPR_RSPI1_SPEI1 = 0x15, IPR_RSPI1_SPRI1 = 0x15, IPR_RSPI1_SPTI1 = 0x15, IPR_RSPI1_SPII1 = 0x15,
    IPR_CAN0_ERS0 = 0x18, IPR_CAN0_RXF0 = 0x18, IPR_CAN0_TXF0 = 0x18, IPR_CAN0_RXM0 = 0x18, IPR_CAN0_TXM0 = 0x18,
    IPR_RTC_PRD = 0x1E, IPR_RTC_CUP = 0x1F,
    IPR_ICU_IRQ0 = 0x20, IPR_ICU_IRQ1 = 0x21, IPR_ICU_IRQ2 = 0x22, IPR_ICU_IRQ3 = 0x23, IPR_ICU_IRQ4 = 0x24, IPR_ICU_IRQ5 = 0x25, IPR_ICU_IRQ6 = 0x26, IPR_ICU_IRQ7 = 0x27, IPR_ICU_IRQ8 = 0x28, IPR_ICU_IRQ9 = 0x29, IPR_ICU_IRQ10 = 0x2A, IPR_ICU_IRQ11 = 0x2B, IPR_ICU_IRQ12 = 0x2C, IPR_ICU_IRQ13 = 0x2D, IPR_ICU_IRQ14 = 0x2E, IPR_ICU_IRQ15 = 0x2F,
    IPR_USB_USBR0 = 0x3A, IPR_USB_USBR1 = 0x3B,
    IPR_RTC_ALM = 0x3C,
    IPR_WDT_WOVI = 0x40,
    IPR_AD0_ADI0 = 0x44,
    IPR_AD1_ADI1 = 0x45,
    IPR_S12AD_ADI = 0x48,
    IPR_MTU0_TGIA0 = 0x51, IPR_MTU0_TGIB0 = 0x51, IPR_MTU0_TGIC0 = 0x51, IPR_MTU0_TGID0 = 0x51, IPR_MTU0_TCIV0 = 0x52, IPR_MTU0_TGIE0 = 0x52, IPR_MTU0_TGIF0 = 0x52,
    IPR_MTU1_TGIA1 = 0x53, IPR_MTU1_TGIB1 = 0x53, IPR_MTU1_TCIV1 = 0x54, IPR_MTU1_TCIU1 = 0x54,
    IPR_MTU2_TGIA2 = 0x55, IPR_MTU2_TGIB2 = 0x55, IPR_MTU2_TCIV2 = 0x56, IPR_MTU2_TCIU2 = 0x56,
    IPR_MTU3_TGIA3 = 0x57, IPR_MTU3_TGIB3 = 0x57, IPR_MTU3_TGIC3 = 0x57, IPR_MTU3_TGID3 = 0x57, IPR_MTU3_TCIV3 = 0x58,
    IPR_MTU4_TGIA4 = 0x59, IPR_MTU4_TGIB4 = 0x59, IPR_MTU4_TGIC4 = 0x59, IPR_MTU4_TGID4 = 0x59, IPR_MTU4_TCIV4 = 0x5A,
    IPR_MTU5_TGIU5 = 0x5B, IPR_MTU5_TGIV5 = 0x5B, IPR_MTU5_TGIW5 = 0x5B,
    IPR_MTU6_TGIA6 = 0x5C, IPR_MTU6_TGIB6 = 0x5C, IPR_MTU6_TGIC6 = 0x5C, IPR_MTU6_TGID6 = 0x5C, IPR_MTU6_TCIV6 = 0x5D, IPR_MTU6_TGIE6 = 0x5D, IPR_MTU6_TGIF6 = 0x5D,
    IPR_MTU7_TGIA7 = 0x5E, IPR_MTU7_TGIB7 = 0x5E, IPR_MTU7_TCIV7 = 0x5F, IPR_MTU7_TCIU7 = 0x5F,
    IPR_MTU8_TGIA8 = 0x60, IPR_MTU8_TGIB8 = 0x60, IPR_MTU8_TCIV8 = 0x61, IPR_MTU8_TCIU8 = 0x61,
    IPR_MTU9_TGIA9 = 0x62, IPR_MTU9_TGIB9 = 0x62, IPR_MTU9_TGIC9 = 0x62, IPR_MTU9_TGID9 = 0x62, IPR_MTU9_TCIV9 = 0x63,
    IPR_MTU10_TGIA10 = 0x64, IPR_MTU10_TGIB10 = 0x64, IPR_MTU10_TGIC10 = 0x64, IPR_MTU10_TGID10 = 0x64, IPR_MTU10_TCIV10 = 0x65,
    IPR_MTU11_TGIU11 = 0x66, IPR_MTU11_TGIV11 = 0x66, IPR_MTU11_TGIW11 = 0x66,
    IPR_POE_OEI1 = 0x67, IPR_POE_OEI2 = 0x67, IPR_POE_OEI3 = 0x67, IPR_POE_OEI4 = 0x67,
    IPR_TMR0_CMIA0 = 0x68, IPR_TMR0_CMIB0 = 0x68, IPR_TMR0_OVI0 = 0x68,
    IPR_TMR1_CMIA1 = 0x69, IPR_TMR1_CMIB1 = 0x69, IPR_TMR1_OVI1 = 0x69,
    IPR_TMR2_CMIA2 = 0x6A, IPR_TMR2_CMIB2 = 0x6A, IPR_TMR2_OVI2 = 0x6A,
    IPR_TMR3_CMIA3 = 0x6B, IPR_TMR3_CMIB3 = 0x6B, IPR_TMR3_OVI3 = 0x6B,
    IPR_DMAC_DMAC0I = 0x70, IPR_DMAC_DMAC1I = 0x71, IPR_DMAC_DMAC2I = 0x72, IPR_DMAC_DMAC3I = 0x73,
    IPR_EXDMAC_EXDMAC0I = 0x74, IPR_EXDMAC_EXDMAC1I = 0x75,
    IPR_SCI0_ERI0 = 0x80, IPR_SCI0_RXI0 = 0x80, IPR_SCI0_TXI0 = 0x80, IPR_SCI0_TEI0 = 0x80,
    IPR_SCI1_ERI1 = 0x81, IPR_SCI1_RXI1 = 0x81, IPR_SCI1_TXI1 = 0x81, IPR_SCI1_TEI1 = 0x81,
    IPR_SCI2_ERI2 = 0x82, IPR_SCI2_RXI2 = 0x82, IPR_SCI2_TXI2 = 0x82, IPR_SCI2_TEI2 = 0x82,
    IPR_SCI3_ERI3 = 0x83, IPR_SCI3_RXI3 = 0x83, IPR_SCI3_TXI3 = 0x83, IPR_SCI3_TEI3 = 0x83,
    IPR_SCI5_ERI5 = 0x85, IPR_SCI5_RXI5 = 0x85, IPR_SCI5_TXI5 = 0x85, IPR_SCI5_TEI5 = 0x85,
    IPR_SCI6_ERI6 = 0x86, IPR_SCI6_RXI6 = 0x86, IPR_SCI6_TXI6 = 0x86, IPR_SCI6_TEI6 = 0x86,
    IPR_RIIC0_ICEEI0 = 0x88, IPR_RIIC0_ICRXI0 = 0x89, IPR_RIIC0_ICTXI0 = 0x8A, IPR_RIIC0_ICTEI0 = 0x8B,
    IPR_RIIC1_ICEEI1 = 0x8C, IPR_RIIC1_ICRXI1 = 0x8D, IPR_RIIC1_ICTXI1 = 0x8E, IPR_RIIC1_ICTEI1 = 0x8F,
    IPR_BSC_ = 0x00,
    IPR_CMT0_ = 0x04,
    IPR_CMT1_ = 0x05,
    IPR_CMT2_ = 0x06,
    IPR_CMT3_ = 0x07,
    IPR_ETHER_ = 0x08,
    IPR_RSPI0_ = 0x14,
    IPR_RSPI1_ = 0x15,
    IPR_CAN0_ = 0x18,
    IPR_WDT_ = 0x40,
    IPR_AD0_ = 0x44,
    IPR_AD1_ = 0x45,
    IPR_S12AD_ = 0x48,
    IPR_MTU1_TGI = 0x53,
    IPR_MTU1_TCI = 0x54,
    IPR_MTU2_TGI = 0x55,
    IPR_MTU2_TCI = 0x56,
    IPR_MTU3_TGI = 0x57,
    IPR_MTU4_TGI = 0x59,
    IPR_MTU5_ = 0x5B,
    IPR_MTU5_TGI = 0x5B,
    IPR_MTU7_TGI = 0x5E,
    IPR_MTU7_TCI = 0x5F,
    IPR_MTU8_TGI = 0x60,
    IPR_MTU8_TCI = 0x61,
    IPR_MTU9_TGI = 0x62,
    IPR_MTU10_TGI = 0x64,
    IPR_MTU11_ = 0x66,
    IPR_MTU11_TGI = 0x66,
    IPR_POE_ = 0x67,
    IPR_POE_OEI = 0x67,
    IPR_TMR0_ = 0x68,
    IPR_TMR1_ = 0x69,
    IPR_TMR2_ = 0x6A,
    IPR_TMR3_ = 0x6B,
    IPR_SCI0_ = 0x80,
    IPR_SCI1_ = 0x81,
    IPR_SCI2_ = 0x82,
    IPR_SCI3_ = 0x83,
    IPR_SCI5_ = 0x85,
    IPR_SCI6_ = 0x86
};

#define IEN_BSC_BUSERR          IEN0
#define IEN_FCU_FIFERR          IEN5
#define IEN_FCU_FRDYI           IEN7
#define IEN_ICU_SWINT           IEN3
#define IEN_CMT0_CMI0           IEN4
#define IEN_CMT1_CMI1           IEN5
#define IEN_CMT2_CMI2           IEN6
#define IEN_CMT3_CMI3           IEN7
#define IEN_ETHER_EINT          IEN0
#define IEN_USB0_D0FIFO0        IEN4
#define IEN_USB0_D1FIFO0        IEN5
#define IEN_USB0_USBI0          IEN6
#define IEN_USB1_D0FIFO1        IEN0
#define IEN_USB1_D1FIFO1        IEN1
#define IEN_USB1_USBI1          IEN2
#define IEN_RSPI0_SPEI0         IEN4
#define IEN_RSPI0_SPRI0         IEN5
#define IEN_RSPI0_SPTI0         IEN6
#define IEN_RSPI0_SPII0         IEN7
#define IEN_RSPI1_SPEI1         IEN0
#define IEN_RSPI1_SPRI1         IEN1
#define IEN_RSPI1_SPTI1         IEN2
#define IEN_RSPI1_SPII1         IEN3
#define IEN_CAN0_ERS0           IEN0
#define IEN_CAN0_RXF0           IEN1
#define IEN_CAN0_TXF0           IEN2
#define IEN_CAN0_RXM0           IEN3
#define IEN_CAN0_TXM0           IEN4
#define IEN_RTC_PRD             IEN6
#define IEN_RTC_CUP             IEN7
#define IEN_ICU_IRQ0            IEN0
#define IEN_ICU_IRQ1            IEN1
#define IEN_ICU_IRQ2            IEN2
#define IEN_ICU_IRQ3            IEN3
#define IEN_ICU_IRQ4            IEN4
#define IEN_ICU_IRQ5            IEN5
#define IEN_ICU_IRQ6            IEN6
#define IEN_ICU_IRQ7            IEN7
#define IEN_ICU_IRQ8            IEN0
#define IEN_ICU_IRQ9            IEN1
#define IEN_ICU_IRQ10           IEN2
#define IEN_ICU_IRQ11           IEN3
#define IEN_ICU_IRQ12           IEN4
#define IEN_ICU_IRQ13           IEN5
#define IEN_ICU_IRQ14           IEN6
#define IEN_ICU_IRQ15           IEN7
#define IEN_USB_USBR0           IEN2
#define IEN_USB_USBR1           IEN3
#define IEN_RTC_ALM             IEN4
#define IEN_WDT_WOVI            IEN0
#define IEN_AD0_ADI0            IEN2
#define IEN_AD1_ADI1            IEN3
#define IEN_S12AD_ADI           IEN6
#define IEN_MTU0_TGIA0          IEN2
#define IEN_MTU0_TGIB0          IEN3
#define IEN_MTU0_TGIC0          IEN4
#define IEN_MTU0_TGID0          IEN5
#define IEN_MTU0_TCIV0          IEN6
#define IEN_MTU0_TGIE0          IEN7
#define IEN_MTU0_TGIF0          IEN0
#define IEN_MTU1_TGIA1          IEN1
#define IEN_MTU1_TGIB1          IEN2
#define IEN_MTU1_TCIV1          IEN3
#define IEN_MTU1_TCIU1          IEN4
#define IEN_MTU2_TGIA2          IEN5
#define IEN_MTU2_TGIB2          IEN6
#define IEN_MTU2_TCIV2          IEN7
#define IEN_MTU2_TCIU2          IEN0
#define IEN_MTU3_TGIA3          IEN1
#define IEN_MTU3_TGIB3          IEN2
#define IEN_MTU3_TGIC3          IEN3
#define IEN_MTU3_TGID3          IEN4
#define IEN_MTU3_TCIV3          IEN5
#define IEN_MTU4_TGIA4          IEN6
#define IEN_MTU4_TGIB4          IEN7
#define IEN_MTU4_TGIC4          IEN0
#define IEN_MTU4_TGID4          IEN1
#define IEN_MTU4_TCIV4          IEN2
#define IEN_MTU5_TGIU5          IEN3
#define IEN_MTU5_TGIV5          IEN4
#define IEN_MTU5_TGIW5          IEN7
#define IEN_MTU6_TGIA6          IEN6
#define IEN_MTU6_TGIB6          IEN7
#define IEN_MTU6_TGIC6          IEN0
#define IEN_MTU6_TGID6          IEN1
#define IEN_MTU6_TCIV6          IEN2
#define IEN_MTU6_TGIE6          IEN3
#define IEN_MTU6_TGIF6          IEN4
#define IEN_MTU7_TGIA7          IEN5
#define IEN_MTU7_TGIB7          IEN6
#define IEN_MTU7_TCIV7          IEN7
#define IEN_MTU7_TCIU7          IEN0
#define IEN_MTU8_TGIA8          IEN1
#define IEN_MTU8_TGIB8          IEN2
#define IEN_MTU8_TCIV8          IEN3
#define IEN_MTU8_TCIU8          IEN4
#define IEN_MTU9_TGIA9          IEN5
#define IEN_MTU9_TGIB9          IEN6
#define IEN_MTU9_TGIC9          IEN7
#define IEN_MTU9_TGID9          IEN0
#define IEN_MTU9_TCIV9          IEN1
#define IEN_MTU10_TGIA10        IEN2
#define IEN_MTU10_TGIB10        IEN3
#define IEN_MTU10_TGIC10        IEN4
#define IEN_MTU10_TGID10        IEN5
#define IEN_MTU10_TCIV10        IEN6
#define IEN_MTU11_TGIU11        IEN7
#define IEN_MTU11_TGIV11        IEN0
#define IEN_MTU11_TGIW11        IEN1
#define IEN_POE_OEI1            IEN2
#define IEN_POE_OEI2            IEN3
#define IEN_POE_OEI3            IEN4
#define IEN_POE_OEI4            IEN5
#define IEN_TMR0_CMIA0          IEN6
#define IEN_TMR0_CMIB0          IEN7
#define IEN_TMR0_OVI0           IEN0
#define IEN_TMR1_CMIA1          IEN1
#define IEN_TMR1_CMIB1          IEN2
#define IEN_TMR1_OVI1           IEN3
#define IEN_TMR2_CMIA2          IEN4
#define IEN_TMR2_CMIB2          IEN5
#define IEN_TMR2_OVI2           IEN6
#define IEN_TMR3_CMIA3          IEN7
#define IEN_TMR3_CMIB3          IEN0
#define IEN_TMR3_OVI3           IEN1
#define IEN_DMAC_DMAC0I         IEN6
#define IEN_DMAC_DMAC1I         IEN7
#define IEN_DMAC_DMAC2I         IEN0
#define IEN_DMAC_DMAC3I         IEN1
#define IEN_EXDMAC_EXDMAC0I     IEN2
#define IEN_EXDMAC_EXDMAC1I     IEN3
#define IEN_SCI0_ERI0           IEN6
#define IEN_SCI0_RXI0           IEN7
#define IEN_SCI0_TXI0           IEN0
#define IEN_SCI0_TEI0           IEN1
#define IEN_SCI1_ERI1           IEN2
#define IEN_SCI1_RXI1           IEN3
#define IEN_SCI1_TXI1           IEN4
#define IEN_SCI1_TEI1           IEN5
#define IEN_SCI2_ERI2           IEN6
#define IEN_SCI2_RXI2           IEN7
#define IEN_SCI2_TXI2           IEN0
#define IEN_SCI2_TEI2           IEN1
#define IEN_SCI3_ERI3           IEN2
#define IEN_SCI3_RXI3           IEN3
#define IEN_SCI3_TXI3           IEN4
#define IEN_SCI3_TEI3           IEN5
#define IEN_SCI5_ERI5           IEN2
#define IEN_SCI5_RXI5           IEN3
#define IEN_SCI5_TXI5           IEN4
#define IEN_SCI5_TEI5           IEN5
#define IEN_SCI6_ERI6           IEN6
#define IEN_SCI6_RXI6           IEN7
#define IEN_SCI6_TXI6           IEN0
#define IEN_SCI6_TEI6           IEN1
#define IEN_RIIC0_ICEEI0        IEN6
#define IEN_RIIC0_ICRXI0        IEN7
#define IEN_RIIC0_ICTXI0        IEN0
#define IEN_RIIC0_ICTEI0        IEN1
#define IEN_RIIC1_ICEEI1        IEN2
#define IEN_RIIC1_ICRXI1        IEN3
#define IEN_RIIC1_ICTXI1        IEN4
#define IEN_RIIC1_ICTEI1        IEN5

