FreeRTOS/FreeRTOS/FreeRTOS/Demo/RX200_RX210-RSK_Renesas/RTOSDemo/include/RX62Niodefine.h
#define VECT_BSC_BUSERR         16
#define VECT_FCU_FIFERR         21
#define VECT_FCU_FRDYI          23
#define VECT_ICU_SWINT          27
#define VECT_CMT0_CMI0          28
#define VECT_CMT1_CMI1          29
#define VECT_CMT2_CMI2          30
#define VECT_CMT3_CMI3          31
#define VECT_ETHER_EINT         32
#define VECT_USB0_D0FIFO0       36
#define VECT_USB0_D1FIFO0       37
#define VECT_USB0_USBI0         38
#define VECT_USB1_D0FIFO1       40
#define VECT_USB1_D1FIFO1       41
#define VECT_USB1_USBI1         42
#define VECT_RSPI0_SPEI0        44
#define VECT_RSPI0_SPRI0        45
#define VECT_RSPI0_SPTI0        46
#define VECT_RSPI0_SPII0        47
#define VECT_RSPI1_SPEI1        48
#define VECT_RSPI1_SPRI1        49
#define VECT_RSPI1_SPTI1        50
#define VECT_RSPI1_SPII1        51
#define VECT_CAN0_ERS0          56
#define VECT_CAN0_RXF0          57
#define VECT_CAN0_TXF0          58
#define VECT_CAN0_RXM0          59
#define VECT_CAN0_TXM0          60
#define VECT_RTC_PRD            62
#define VECT_RTC_CUP            63
#define VECT_ICU_IRQ0           64
#define VECT_ICU_IRQ1           65
#define VECT_ICU_IRQ2           66
#define VECT_ICU_IRQ3           67
#define VECT_ICU_IRQ4           68
#define VECT_ICU_IRQ5           69
#define VECT_ICU_IRQ6           70
#define VECT_ICU_IRQ7           71
#define VECT_ICU_IRQ8           72
#define VECT_ICU_IRQ9           73
#define VECT_ICU_IRQ10          74
#define VECT_ICU_IRQ11          75
#define VECT_ICU_IRQ12          76
#define VECT_ICU_IRQ13          77
#define VECT_ICU_IRQ14          78
#define VECT_ICU_IRQ15          79
#define VECT_USB_USBR0          90
#define VECT_USB_USBR1          91
#define VECT_RTC_ALM            92
#define VECT_WDT_WOVI           96
#define VECT_AD0_ADI0           98
#define VECT_AD1_ADI1           99
#define VECT_S12AD_ADI          102
#define VECT_MTU0_TGIA0         114
#define VECT_MTU0_TGIB0         115
#define VECT_MTU0_TGIC0         116
#define VECT_MTU0_TGID0         117
#define VECT_MTU0_TCIV0         118
#define VECT_MTU0_TGIE0         119
#define VECT_MTU0_TGIF0         120
#define VECT_MTU1_TGIA1         121
#define VECT_MTU1_TGIB1         122
#define VECT_MTU1_TCIV1         123
#define VECT_MTU1_TCIU1         124
#define VECT_MTU2_TGIA2         125
#define VECT_MTU2_TGIB2         126
#define VECT_MTU2_TCIV2         127
#define VECT_MTU2_TCIU2         128
#define VECT_MTU3_TGIA3         129
#define VECT_MTU3_TGIB3         130
#define VECT_MTU3_TGIC3         131
#define VECT_MTU3_TGID3         132
#define VECT_MTU3_TCIV3         133
#define VECT_MTU4_TGIA4         134
#define VECT_MTU4_TGIB4         135
#define VECT_MTU4_TGIC4         136
#define VECT_MTU4_TGID4         137
#define VECT_MTU4_TCIV4         138
#define VECT_MTU5_TGIU5         139
#define VECT_MTU5_TGIV5         140
#define VECT_MTU5_TGIW5         141
#define VECT_MTU6_TGIA6         142
#define VECT_MTU6_TGIB6         143
#define VECT_MTU6_TGIC6         144
#define VECT_MTU6_TGID6         145
#define VECT_MTU6_TCIV6         146
#define VECT_MTU6_TGIE6         147
#define VECT_MTU6_TGIF6         148
#define VECT_MTU7_TGIA7         149
#define VECT_MTU7_TGIB7         150
#define VECT_MTU7_TCIV7         151
#define VECT_MTU7_TCIU7         152
#define VECT_MTU8_TGIA8         153
#define VECT_MTU8_TGIB8         154
#define VECT_MTU8_TCIV8         155
#define VECT_MTU8_TCIU8         156
#define VECT_MTU9_TGIA9         157
#define VECT_MTU9_TGIB9         158
#define VECT_MTU9_TGIC9         159
#define VECT_MTU9_TGID9         160
#define VECT_MTU9_TCIV9         161
#define VECT_MTU10_TGIA10       162
#define VECT_MTU10_TGIB10       163
#define VECT_MTU10_TGIC10       164
#define VECT_MTU10_TGID10       165
#define VECT_MTU10_TCIV10       166
#define VECT_MTU11_TGIU11       167
#define VECT_MTU11_TGIV11       168
#define VECT_MTU11_TGIW11       169
#define VECT_POE_OEI1           170
#define VECT_POE_OEI2           171
#define VECT_POE_OEI3           172
#define VECT_POE_OEI4           173
#define VECT_TMR0_CMIA0         174
#define VECT_TMR0_CMIB0         175
#define VECT_TMR0_OVI0          176
#define VECT_TMR1_CMIA1         177
#define VECT_TMR1_CMIB1         178
#define VECT_TMR1_OVI1          179
#define VECT_TMR2_CMIA2         180
#define VECT_TMR2_CMIB2         181
#define VECT_TMR2_OVI2          182
#define VECT_TMR3_CMIA3         183
#define VECT_TMR3_CMIB3         184
#define VECT_TMR3_OVI3          185
#define VECT_DMAC_DMAC0I        198
#define VECT_DMAC_DMAC1I        199
#define VECT_DMAC_DMAC2I        200
#define VECT_DMAC_DMAC3I        201
#define VECT_EXDMAC_EXDMAC0I    202
#define VECT_EXDMAC_EXDMAC1I    203
#define VECT_SCI0_ERI0          214
#define VECT_SCI0_RXI0          215
#define VECT_SCI0_TXI0          216
#define VECT_SCI0_TEI0          217
#define VECT_SCI1_ERI1          218
#define VECT_SCI1_RXI1          219
#define VECT_SCI1_TXI1          220
#define VECT_SCI1_TEI1          221
#define VECT_SCI2_ERI2          222
#define VECT_SCI2_RXI2          223
#define VECT_SCI2_TXI2          224
#define VECT_SCI2_TEI2          225
#define VECT_SCI3_ERI3          226
#define VECT_SCI3_RXI3          227
#define VECT_SCI3_TXI3          228
#define VECT_SCI3_TEI3          229
#define VECT_SCI5_ERI5          234
#define VECT_SCI5_RXI5          235
#define VECT_SCI5_TXI5          236
#define VECT_SCI5_TEI5          237
#define VECT_SCI6_ERI6          238
#define VECT_SCI6_RXI6          239
#define VECT_SCI6_TXI6          240
#define VECT_SCI6_TEI6          241
#define VECT_RIIC0_ICEEI0       246
#define VECT_RIIC0_ICRXI0       247
#define VECT_RIIC0_ICTXI0       248
#define VECT_RIIC0_ICTEI0       249
#define VECT_RIIC1_ICEEI1       250
#define VECT_RIIC1_ICRXI1       251
#define VECT_RIIC1_ICTXI1       252
#define VECT_RIIC1_ICTEI1       253

#define MSTP_EXDMAC             SYSTEM.MSTPCRA.BIT.MSTPA29
#define MSTP_DMAC               SYSTEM.MSTPCRA.BIT.MSTPA28
#define MSTP_DMAC0              SYSTEM.MSTPCRA.BIT.MSTPA28
#define MSTP_DMAC1              SYSTEM.MSTPCRA.BIT.MSTPA28
#define MSTP_DMAC2              SYSTEM.MSTPCRA.BIT.MSTPA28
#define MSTP_DMAC3              SYSTEM.MSTPCRA.BIT.MSTPA28
#define MSTP_DTC                SYSTEM.MSTPCRA.BIT.MSTPA28
#define MSTP_AD0                SYSTEM.MSTPCRA.BIT.MSTPA23
#define MSTP_AD1                SYSTEM.MSTPCRA.BIT.MSTPA22
#define MSTP_DA                 SYSTEM.MSTPCRA.BIT.MSTPA19
#define MSTP_S12AD              SYSTEM.MSTPCRA.BIT.MSTPA17
#define MSTP_CMT0               SYSTEM.MSTPCRA.BIT.MSTPA15
#define MSTP_CMT1               SYSTEM.MSTPCRA.BIT.MSTPA15
#define MSTP_CMT2               SYSTEM.MSTPCRA.BIT.MSTPA14
#define MSTP_CMT3               SYSTEM.MSTPCRA.BIT.MSTPA14
#define MSTP_PPG0               SYSTEM.MSTPCRA.BIT.MSTPA11
#define MSTP_PPG1               SYSTEM.MSTPCRA.BIT.MSTPA10
#define MSTP_MTUA               SYSTEM.MSTPCRA.BIT.MSTPA9
#define MSTP_MTU0               SYSTEM.MSTPCRA.BIT.MSTPA9
#define MSTP_MTU1               SYSTEM.MSTPCRA.BIT.MSTPA9
#define MSTP_MTU2               SYSTEM.MSTPCRA.BIT.MSTPA9
#define MSTP_MTU3               SYSTEM.MSTPCRA.BIT.MSTPA9
#define MSTP_MTU4               SYSTEM.MSTPCRA.BIT.MSTPA9
#define MSTP_MTU5               SYSTEM.MSTPCRA.BIT.MSTPA9
#define MSTP_MTUB               SYSTEM.MSTPCRA.BIT.MSTPA8
#define MSTP_MTU6               SYSTEM.MSTPCRA.BIT.MSTPA8
#define MSTP_MTU7               SYSTEM.MSTPCRA.BIT.MSTPA8
#define MSTP_MTU8               SYSTEM.MSTPCRA.BIT.MSTPA8
#define MSTP_MTU9               SYSTEM.MSTPCRA.BIT.MSTPA8
#define MSTP_MTU10              SYSTEM.MSTPCRA.BIT.MSTPA8
#define MSTP_MTU11              SYSTEM.MSTPCRA.BIT.MSTPA8
#define MSTP_TMR0               SYSTEM.MSTPCRA.BIT.MSTPA5
#define MSTP_TMR1               SYSTEM.MSTPCRA.BIT.MSTPA5
#define MSTP_TMR01              SYSTEM.MSTPCRA.BIT.MSTPA5
#define MSTP_TMR2               SYSTEM.MSTPCRA.BIT.MSTPA4
#define MSTP_TMR3               SYSTEM.MSTPCRA.BIT.MSTPA4
#define MSTP_TMR23              SYSTEM.MSTPCRA.BIT.MSTPA4
#define MSTP_SCI0               SYSTEM.MSTPCRB.BIT.MSTPB31
#define MSTP_SMCI0              SYSTEM.MSTPCRB.BIT.MSTPB31
#define MSTP_SCI1               SYSTEM.MSTPCRB.BIT.MSTPB30
#define MSTP_SMCI1              SYSTEM.MSTPCRB.BIT.MSTPB30
#define MSTP_SCI2               SYSTEM.MSTPCRB.BIT.MSTPB29
#define MSTP_SMCI2              SYSTEM.MSTPCRB.BIT.MSTPB29
#define MSTP_SCI3               SYSTEM.MSTPCRB.BIT.MSTPB28
#define MSTP_SMCI3              SYSTEM.MSTPCRB.BIT.MSTPB28
#define MSTP_SCI5               SYSTEM.MSTPCRB.BIT.MSTPB26
#define MSTP_SMCI5              SYSTEM.MSTPCRB.BIT.MSTPB26
#define MSTP_SCI6               SYSTEM.MSTPCRB.BIT.MSTPB25
#define MSTP_SMCI6              SYSTEM.MSTPCRB.BIT.MSTPB25
#define MSTP_CRC                SYSTEM.MSTPCRB.BIT.MSTPB23
#define MSTP_RIIC0              SYSTEM.MSTPCRB.BIT.MSTPB21
#define MSTP_RIIC1              SYSTEM.MSTPCRB.BIT.MSTPB20
#define MSTP_USB0               SYSTEM.MSTPCRB.BIT.MSTPB19
#define MSTP_USB1               SYSTEM.MSTPCRB.BIT.MSTPB18
#define MSTP_RSPI0              SYSTEM.MSTPCRB.BIT.MSTPB17
#define MSTP_RSPI1              SYSTEM.MSTPCRB.BIT.MSTPB16
#define MSTP_EDMAC              SYSTEM.MSTPCRB.BIT.MSTPB15
#define MSTP_CAN0               SYSTEM.MSTPCRB.BIT.MSTPB0
#define MSTP_RAM0               SYSTEM.MSTPCRC.BIT.MSTPC1
#define MSTP_RAM1               SYSTEM.MSTPCRC.BIT.MSTPC0

